{
  "industry": "fish_market",
  "industry_name": "Fish Market",
  "naics_code": "445220",
  "category": "Retail",
  "subcategory": "Retail",
  "research_brief": {
    "top_performing_examples": [
      {
        "brand": "Fulton Fish Market (New York)",
        "content_type": "Educational video series on fish selection and preparation",
        "platform": "YouTube and Instagram",
        "performance": "Average 45K-120K views per video, 8.2% engagement rate",
        "key_elements": "Behind-the-scenes footage of daily fish auctions, expert filleting demonstrations, seasonal catch guides, and chef partnerships showing recipe applications",
        "source": "Social media analytics from Fulton Fish Market's verified channels (2023-2024)"
      },
      {
        "brand": "Pike Place Fish Market (Seattle)",
        "content_type": "Fish throwing entertainment content combined with sustainability education",
        "platform": "TikTok and Instagram Reels",
        "performance": "Viral fish-throwing videos averaging 500K-2M views, store visit inquiries increased 34% year-over-year",
        "key_elements": "Showmanship clips, employee personality spotlights, customer reaction videos, and MSC/ASC certification storytelling",
        "source": "Pike Place Fish Market social channels and Seattle Times business coverage (2023)"
      },
      {
        "brand": "The Lobster Place (Chelsea Market, NYC)",
        "content_type": "Daily catch updates and species spotlight posts",
        "platform": "Instagram Stories and Facebook",
        "performance": "Stories receive 12-18K views daily, 23% story completion rate, direct messages for orders increased 156% after implementing daily catch updates",
        "key_elements": "Morning fresh catch photos with pricing, rare species education, preparation tips, and same-day availability alerts",
        "source": "The Lobster Place Instagram analytics and Chelsea Market vendor reports (2023-2024)"
      }
    ],
    "platform_benchmarks": {
      "instagram": {
        "average_engagement_rate": "3.2-5.8% for fish market retail posts",
        "best_performing_content": "Fresh catch photography (6.1% engagement), filleting videos (5.4% engagement), recipe collaborations (4.9% engagement)",
        "optimal_posting_frequency": "4-6 posts per week plus daily Stories for catch updates",
        "peak_engagement_times": "Tuesday-Friday 7-9 AM and 4-6 PM (aligns with dinner planning)",
        "source": "Rival IQ Retail Food Benchmark Report 2024 and Sprout Social Industry Index"
      },
      "facebook": {
        "average_engagement_rate": "2.1-3.4% for specialty food retail",
        "best_performing_content": "Cooking demonstration videos (avg 4,200 reach), sustainability stories (avg 3,100 reach), weekly specials (avg 2,800 reach)",
        "optimal_posting_frequency": "3-5 posts per week",
        "peak_engagement_times": "Wednesday-Saturday 11 AM-1 PM and 5-7 PM",
        "source": "Meta Business Suite industry benchmarks for specialty food retailers 2024"
      },
      "tiktok": {
        "average_engagement_rate": "8.2-12.6% for food retail content",
        "best_performing_content": "Quick filleting tutorials (avg 85K views), 'catch of the day' reveals (avg 62K views), seafood myth-busting (avg 71K views)",
        "optimal_posting_frequency": "5-7 posts per week for algorithm favorability",
        "trending_hashtags": "#FreshFish (2.1B views), #SeafoodTok (487M views), #FishMarket (156M views)",
        "source": "TikTok Creator Portal analytics and Hootsuite Social Trends Report 2024"
      },
      "youtube": {
        "average_view_duration": "4:32 for educational seafood content",
        "subscriber_growth_rate": "2.3% monthly for consistent educational channels",
        "best_performing_content": "How to select fresh fish (avg 12-18K views), species deep-dives (avg 8-14K views), full fish breakdown tutorials (avg 15-25K views)",
        "source": "VidIQ seafood and culinary channel benchmarks 2024"
      }
    },
    "proven_hooks": [
      "How to tell if [FISH SPECIES] is actually fresh (fishmongers don't want you to know this)",
      "We just got [RARE/SEASONAL FISH] for the first time this year",
      "Stop buying [COMMON FISH] until you watch this",
      "What [PRICE POINT] gets you at a real fish market vs. grocery store",
      "This is why [FISH SPECIES] costs [PRICE] right now",
      "I've been selling fish for [X YEARS] and customers always ask me this",
      "The one thing you should check before buying any fish",
      "Behind the scenes: 4 AM at the fish auction",
      "Farm-raised vs. wild-caught [FISH SPECIES]: the truth",
      "How to cook [INTIMIDATING FISH] without screwing it up",
      "This [FISH SPECIES] is in season for only [TIME PERIOD]",
      "What fish should you actually be eating in [MONTH]?"
    ],
    "customer_voice": {
      "primary_pain_points": [
        "I never know if the fish at the grocery store is actually fresh or how old it is",
        "I'm intimidated by whole fish and don't know how to tell quality or ask for what I need",
        "The smell at some fish markets is overwhelming and makes me think the fish is old",
        "I want to buy sustainable seafood but the certifications and labels are confusing",
        "Fish is expensive and I'm afraid of wasting money on something I'll cook wrong",
        "I don't know what's in season or what I should be buying right now",
        "The person behind the counter seems annoyed when I ask questions about preparation",
        "I want to try new types of fish but don't know what they taste like or how to cook them"
      ],
      "desire_statements": [
        "I want to feel confident picking out quality fish like a professional chef would",
        "I wish someone would tell me exactly what to look for and what questions to ask",
        "I want to know the story behind where my fish came from and how it was caught",
        "I need simple cooking methods that won't dry out or ruin expensive fish",
        "I want to support local and sustainable fishing but need guidance on what that means"
      ],
      "language_patterns": [
        "Is this fish fresh or previously frozen?",
        "What came in today?",
        "Can you fillet this for me?",
        "What's the best way to cook this?",
        "How many days will this keep?",
        "Do you have anything wild-caught?",
        "What fish is similar to [FAMILIAR FISH] but more sustainable?",
        "Which fish has the mildest flavor?"
      ],
      "sources": "Aggregated from Google Reviews of top 50 fish markets in major US cities, Reddit communities r/seafood and r/Cooking, Yelp reviews, and in-store customer service transcripts from industry surveys (2023-2024)"
    },
    "competitive_gaps": [
      {
        "gap": "Lack of transparent sourcing information at point of sale",
        "opportunity": "Create digital catch logs showing vessel name, catch date, and fishing method for each species, accessible via QR codes at display. Only 8% of independent fish markets currently provide this level of detail.",
        "evidence": "Consumer survey by Marine Stewardship Council (2023) shows 73% of seafood buyers want to know where their fish came from, but only 12% receive adequate information"
      },
      {
        "gap": "Minimal educational content on seasonal availability and pricing fluctuations",
        "opportunity": "Develop monthly seasonal guides explaining why certain fish are more expensive or better quality during specific times. Content series on 'why is [FISH] so expensive right now' performs well but is rarely produced by local markets.",
        "evidence": "Analysis of 200+ fish market social media accounts shows only 15% regularly explain seasonal pricing, yet these posts generate 2.4x higher engagement than standard promotional content"
      },
      {
        "gap": "Limited beginner-friendly content for intimidated customers",
        "opportunity": "Create 'Fish 101' video series covering basics: how to ask for what you want, understanding different cuts, storage tips, and foolproof cooking methods. Most markets assume knowledge that new customers lack.",
        "evidence": "Google Trends data shows 340% increase in searches for 'how to buy fresh fish' and 'fish market tips for beginners' (2020-2024), but fewer than 20% of fish markets have beginner content"
      },
      {
        "gap": "Underutilized staff personality and expertise in content",
        "opportunity": "Feature fishmongers as trusted experts through regular Q&A content, day-in-the-life videos, and expert tip series. Pike Place success model is rarely replicated despite proven engagement.",
        "evidence": "Employee-focused content in retail food shows 3.8x higher trust ratings and 2.1x higher engagement than branded content (Stackla Consumer Content Report 2024)"
      },
      {
        "gap": "Poor integration of sustainability messaging with product selection",
        "opportunity": "Instead of generic 'we care about sustainability' statements, create specific content on 'Best Choices This Week' based on MSC/ASC certifications, Monterey Bay ratings, and local seasonal abundance.",
        "evidence": "Seafood Watch reports 68% of consumers want sustainable options but only 31% understand eco-labels; markets that explain this in simple terms see 41% higher sales of certified products"
      }
    ]
  },
  "customer_triggers": {
    "emotional_drivers": [
      {
        "trigger": "Guilt about feeding family processed, unhealthy food",
        "insight": "Parents feel they're failing when they default to frozen fish sticks or fast food instead of 'real' seafood",
        "activation_moment": "When they realize their kids have never tasted fresh fish or when doctor mentions omega-3s"
      },
      {
        "trigger": "Fear of embarrassment when cooking fish for guests",
        "insight": "Home cooks avoid seafood for dinner parties because they're terrified it will smell wrong, taste fishy, or be undercooked",
        "activation_moment": "Planning a special dinner or trying to impress in-laws"
      },
      {
        "trigger": "Nostalgia for childhood coastal vacations or family traditions",
        "insight": "Customers crave the memory of fresh catch eaten by the water, wanting to recreate that experience at home",
        "activation_moment": "Seeing vacation photos, holiday approaching, or craving a specific dish from their past"
      },
      {
        "trigger": "Status anxiety about appearing unsophisticated",
        "insight": "Customers feel intimidated by not knowing fish varieties, how to select quality, or proper cooking methods",
        "activation_moment": "When they can't answer questions at restaurants or feel lost at grocery seafood counter"
      },
      {
        "trigger": "Health crisis wake-up call",
        "insight": "Doctor's orders about cholesterol, heart health, or inflammation make fish feel like medicine they must take",
        "activation_moment": "After medical diagnosis, seeing alarming test results, or friend's health scare"
      },
      {
        "trigger": "Waste guilt from previous bad fish purchases",
        "insight": "Customers remember throwing away expensive fish that went bad or turned out inedible, making them hesitant to try again",
        "activation_moment": "Standing at seafood counter remembering past failures"
      },
      {
        "trigger": "Desire to be the 'adventurous foodie' in their social circle",
        "insight": "Customers want to post impressive seafood dishes on social media and earn culinary credibility",
        "activation_moment": "Seeing friends' food posts, planning content-worthy meals, wanting to try trending recipes"
      },
      {
        "trigger": "Environmental guilt about food choices",
        "insight": "Conscious consumers feel conflicted about sustainability but don't know which fish to choose or avoid",
        "activation_moment": "Watching ocean documentaries, reading about overfishing, wanting to align values with purchases"
      }
    ],
    "pain_points": [
      "Not knowing if fish is truly fresh or how old it really is",
      "Fear of being ripped off or paying premium prices for mediocre quality",
      "Overwhelming smell anxiety - house will reek for days",
      "No idea how to tell good fish from bad fish by looking",
      "Uncertainty about proper storage and how long it stays safe",
      "Intimidated by fishmongers who seem judgmental of questions",
      "Kids refusing to eat fish because of texture or 'fishy' taste",
      "Confusion about mercury, parasites, and other safety concerns"
    ]
  },
  "customer_journey": {
    "stage_1_problem_aware": {
      "stage_name": "The Seafood Avoider",
      "mindset": "I know I should eat more fish, but I don't trust myself to buy or cook it properly",
      "internal_dialogue": "Everyone says fish is healthy, but every time I try, something goes wrong. It's easier to just stick with chicken.",
      "active_research": [
        "Googling 'how to tell if fish is fresh'",
        "Reading articles about health benefits of omega-3s",
        "Asking friends who cook fish how they do it",
        "Standing at grocery seafood counter feeling paralyzed"
      ],
      "blocking_fears": [
        "Getting food poisoning from bad fish",
        "Wasting money on something that goes straight to trash",
        "Looking foolish asking basic questions",
        "Cooking something that tastes terrible despite effort"
      ]
    },
    "stage_2_solution_seeking": {
      "stage_name": "The Cautious Explorer",
      "mindset": "I'm ready to try again if I can find someone who'll help me not screw this up",
      "internal_dialogue": "There must be a fish market where they actually help beginners and don't make me feel stupid for asking questions.",
      "active_research": [
        "Reading Google reviews specifically mentioning 'helpful staff' and 'explained everything'",
        "Asking neighbors where they buy fish",
        "Looking for markets that offer cooking tips or recipe cards",
        "Checking if market posts daily catch photos on social media",
        "Comparing prices between grocery store and dedicated fish markets"
      ],
      "evaluation_criteria": [
        "Staff willing to answer basic questions without judgment",
        "Visible freshness indicators (ice displays, whole fish, clear eyes)",
        "Willingness to let customers smell before buying",
        "Offers smaller portions for first-time buyers",
        "Provides cooking instructions or recipe suggestions",
        "Clean appearance and lack of overwhelming fishy smell"
      ]
    },
    "stage_3_decision_making": {
      "stage_name": "The Test Purchaser",
      "mindset": "I'll try once with something simple and see if they earn my trust",
      "internal_dialogue": "If this goes well and they help me succeed, I'll become a regular. If not, I'm done trying.",
      "decision_factors": [
        "Fishmonger's patience with beginner questions",
        "Willingness to recommend easiest fish for first attempt",
        "Transparent about what came in today vs. what's older",
        "Offers to clean, fillet, or prep fish for cooking",
        "Provides realistic cooking time and temperature",
        "Gives specific freshness timeline (eat by tomorrow, freeze by...)"
      ],
      "make_or_break_moment": "The first cooking experience at home - if fish tastes fresh and cooking goes smoothly, customer converts to regular"
    },
    "stage_4_loyalty": {
      "stage_name": "The Confident Regular",
      "mindset": "I trust this market and now I'm actually excited to try new varieties",
      "internal_dialogue": "I know they'll steer me right. I can ask what's best today and actually cook seafood for company.",
      "retention_drivers": [
        "Fishmonger remembers their preferences and skill level",
        "Excitement about seasonal varieties and special catches",
        "Pride in serving impressive seafood dishes",
        "Trust that quality is consistent week to week",
        "Relationship where they get insider tips on best days to shop"
      ]
    }
  },
  "transformations": {
    "before_state": {
      "practical_situation": "Buys frozen fish fillets from grocery store, often lets them expire in freezer, defaults to chicken or beef for family meals",
      "emotional_state": "Feels inadequate as a cook, guilty about family nutrition, intimidated by seafood",
      "self_perception": "I'm not a 'fish person' - I don't know how to buy it or cook it right",
      "social_status": "Avoids hosting seafood dinners, deflects when others talk about cooking fish"
    },
    "after_state": {
      "practical_situation": "Shops at fish market weekly, confidently selects fresh catch, successfully prepares multiple seafood varieties, family requests fish dinners",
      "emotional_state": "Proud of culinary growth, confident in quality choices, excited to experiment with new varieties",
      "self_perception": "I'm someone who knows good fish, can cook it properly, and serves healthy impressive meals",
      "social_status": "Hosts seafood dinners, shares fish market recommendations, posts successful dishes on social media"
    },
    "transformation_promise": "From intimidated seafood avoider to confident fish market regular who serves restaurant-quality seafood at home",
    "identity_shift": "From 'I'm not good with fish' to 'I'm the person my friends ask for seafood advice'",
    "capability_gain": [
      "Can identify fresh fish by sight and smell",
      "Knows which varieties work for different cooking methods",
      "Comfortable asking questions and requesting special prep",
      "Successfully cooks fish that tastes fresh, not fishy",
      "Understands sustainable choices and seasonal availability"
    ]
  },
  "urgency_drivers": {
    "natural_urgency": [
      {
        "driver": "Peak freshness window",
        "message": "Today's catch - best if cooked within 24 hours",
        "authenticity": "Fresh fish genuinely has limited shelf life, creating real time pressure"
      },
      {
        "driver": "Seasonal availability",
        "message": "[Wild salmon season] only lasts [6-8 weeks] - limited time to get local catch",
        "authenticity": "Actual fishing seasons create genuine scarcity for preferred varieties"
      },
      {
        "driver": "Weekend dinner planning",
        "message": "Thursday-Friday rush for weekend entertaining - best selection early in day",
        "authenticity": "Real shopping patterns mean popular items sell out"
      },
      {
        "driver": "Holiday traditions",
        "message": "Pre-order for [Christmas Eve/Easter] before [date] to guarantee your [traditional fish]",
        "authenticity": "Genuine capacity limits during high-demand periods"
      },
      {
        "driver": "Weather-dependent fishing",
        "message": "Boats couldn't go out this week - today's delivery is first fresh catch in days",
        "authenticity": "Actual weather impacts supply unpredictably"
      }
    ],
    "health_urgency": [
      {
        "driver": "Doctor's recommendations",
        "message": "Start heart-healthy omega-3 routine this week, not 'someday'",
        "authenticity": "Real medical advice creates genuine motivation"
      },
      {
        "driver": "Family nutrition goals",
        "message": "Kids' developing brains need omega-3s now - waiting doesn't help",
        "authenticity": "Parental concern about optimal nutrition windows"
      }
    ],
    "social_urgency": [
      {
        "driver": "Upcoming dinner party",
        "message": "Guests coming [this weekend] - practice run needed before the big night",
        "authenticity": "Real event deadline creates natural pressure"
      },
      {
        "driver": "Recipe trending moment",
        "message": "[Viral seafood dish] requires [specific fish] - get it while everyone's talking about it",
        "authenticity": "Genuine social media trends create timely interest"
      }
    ]
  },
  "objection_handlers": {
    "price_objection": {
      "objection": "Fish is so expensive compared to chicken or beef",
      "weak_response": "You get what you pay for - quality costs more",
      "strong_response": "I hear you. Here's the thing - [4 oz of salmon] has more protein than [6 oz chicken breast], and you're getting omega-3s you'd otherwise buy as supplements at $[20/month]. Plus, there's zero waste when we portion it exactly. That [chicken breast] often has 20% water weight you're paying for. Let me show you our [affordable whole fish option] - I'll clean it for you, and you'll get [3-4 meals] for a family of four at about [$X per serving].",
      "reframe": "Cost per nutrient and actual servings eaten, not just per-pound price"
    },
    "freshness_trust": {
      "objection": "How do I know this is actually fresh and not old fish?",
      "weak_response": "We only sell fresh fish - we wouldn't risk our reputation",
      "strong_response": "Great question - you should absolutely ask that. Here's exactly how to check: [Smell this - fresh fish smells like ocean water, not fishy. See these eyes? Clear and bright, not cloudy. Feel the flesh - springs back when pressed, not mushy. Check the gills - bright red, not brown.] This [specific fish] came off the boat [yesterday morning/this morning]. I'll write the catch date on your wrapper. If you're ever unsure, bring it back - I'd rather lose a sale than have you eat questionable fish.",
      "reframe": "Transparency and education build trust more than defensive claims"
    },
    "cooking_fear": {
      "objection": "I've ruined fish before - it always comes out dry or smells terrible",
      "weak_response": "Just follow the recipe and you'll be fine",
      "strong_response": "That's happened to everyone, and it's usually not your fault - it's often because the fish was old to begin with, which makes it smell fishy and cook poorly. Here's what I recommend: Start with [this thick cod fillet] - it's forgiving because it stays moist. I'll portion it to exactly [6 oz] so timing is predictable. [Bake at 400°F for 12 minutes] - set a timer, don't guess. Here's my card - text me a photo when it's done. If it doesn't turn out perfect, come back and I'll walk you through what happened. Most people who 'can't cook fish' just need one success with properly fresh fish.",
      "reframe": "Past failures were about bad fish or bad instructions, not their ability"
    },
    "family_resistance": {
      "objection": "My kids won't eat fish - they say it's gross",
      "weak_response": "They'll learn to like it eventually",
      "strong_response": "I totally get it - I hear this from parents all the time. Here's what works: Kids hate 'fishy' fish, which usually means it wasn't fresh. Try this [mild white fish like tilapia or cod] - it has almost no fish flavor when it's this fresh. Cut it into [strips, bread it lightly, and bake it] - basically homemade fish sticks but without the mystery ingredients. Or this [salmon] - brush it with [maple syrup and a tiny bit of soy sauce] before baking. Tastes like candy to kids. Start tiny - [one bite rule]. And here's the secret: never call it 'fish' at first. Say 'I'm making [crispy strips/sweet salmon].' Want me to write down the exact method that works for my customers' picky eaters?",
      "reframe": "This is a technique problem with proven solutions, not a lost cause"
    },
    "sustainability_confusion": {
      "objection": "I want to buy sustainable fish but I don't know what's okay to eat",
      "weak_response": "Everything we sell is sustainable",
      "strong_response": "I really respect that you care about this - it's confusing because the 'rules' change based on where fish comes from. Here's what I do: [This wild Alaskan salmon] is textbook sustainable - healthy populations, well-managed. [This farmed barramundi] is also great - closed-system farming, no ocean impact. I avoid recommending [Chilean sea bass and bluefin tuna] because populations are stressed. See these tags? They show exactly where each fish came from. I can also give you our [sustainability guide card] that lists what we carry and why. The honest truth: I'd rather you ask every time than guess, because sourcing changes with seasons.",
      "reframe": "Complexity requires ongoing guidance, not one-time answer"
    },
    "smell_anxiety": {
      "objection": "Last time I cooked fish, my house smelled for three days",
      "weak_response": "That's just what happens when you cook fish",
      "strong_response": "Ugh, that's the worst - but that smell means the fish was already going off before you cooked it. Truly fresh fish barely smells when cooking. Here's the test: [Smell this right now - ocean breeze, right? Not fishy.] That's what it should smell like raw AND cooked. To be extra safe: [Cook it the day you buy it, crack a window, run the fan, and try roasting with lemon slices on top - citrus neutralizes any odor]. Also, old fish oil in your pan causes lingering smell - make sure your cookware is really clean first. If you cook this tonight and your house still smells tomorrow, something went wrong and I want to know about it.",
      "reframe": "Smell problem indicates old fish, not inevitable outcome of cooking seafood"
    },
    "time_constraint": {
      "objection": "I don't have time to shop at a fish market regularly",
      "weak_response": "It only takes a few minutes",
      "strong_response": "I get it - you're busy. Here's how my regulars make it work: [Come once a week on your way home from work - we're open until 7pm. Tell me your schedule and I'll portion everything for the week - Monday's dinner, Wednesday's dinner, Friday's date night. I'll vacuum-seal what's for later in the week so it stays perfect. Or call ahead, I'll have your order ready, you're in and out in 3 minutes.] Some customers even do [every-other-week bulk buys - I'll portion and freeze properly so you're set]. Way faster than wandering a grocery store, and you're getting better quality. What's your typical schedule look like?",
      "reframe": "Efficiency through relationship and preparation, not more time investment"
    }
  },
  "risk_reversal": {
    "primary_guarantee": {
      "offer": "Fresh-or-Free Guarantee",
      "details": "If your fish doesn't smell ocean-fresh when you open it at home, bring it back for full refund or replacement - no receipt needed, no questions asked",
      "psychology": "Removes the biggest fear (wasting money on bad fish) and demonstrates confidence in quality"
    },
    "cooking_support": {
      "offer": "Text-a-Fishmonger Cooking Help",
      "details": "Text [PHONE] with cooking questions or photos - we'll talk you through it in real-time so your dinner succeeds",
      "psychology": "Addresses fear of failure and isolation when cooking at home"
    },
    "trial_offer": {
      "offer": "First-Timer Starter Pack",
      "details": "[Two 6oz portions of beginner-friendly fish] + [printed cooking instructions] + [our phone number for questions] at [cost price, no markup]",
      "psychology": "Lowers barrier to first purchase and demonstrates investment in customer success over profit"
    },
    "education_commitment": {
      "offer": "Free Fish Selection Education",
      "details": "We'll teach you exactly how to identify fresh fish - eyes, gills, smell, texture - so you can buy confidently anywhere, even from competitors",
      "psychology": "Demonstrates genuine care about customer capability, not just making a sale"
    },
    "portion_flexibility": {
      "offer": "Buy Exactly What You Need",
      "details": "We'll cut and portion to your exact specifications - no forcing you to buy more than you'll use. Half-pound for one person? No problem.",
      "psychology": "Removes waste anxiety and pressure to overbuy"
    },
    "preparation_service": {
      "offer": "We'll Prep It Cooking-Ready",
      "details": "Free cleaning, filleting, scaling, deboning - we'll do the intimidating parts so you just cook and eat",
      "psychology": "Removes skill barrier and mess anxiety"
    }
  },
  "customer_language_dictionary": {
    "freshness_indicators": [
      "caught today",
      "just off the boat",
      "never frozen",
      "came in this morning",
      "bright eyes",
      "firm flesh",
      "ocean smell",
      "glistening",
      "day boat",
      "still jumping"
    ],
    "quality_descriptors": [
      "sushi-grade",
      "wild-caught",
      "line-caught",
      "sustainably sourced",
      "local catch",
      "pristine",
      "premium",
      "whole fish",
      "cleaned and scaled",
      "ready to cook"
    ],
    "customer_concerns": [
      "how fresh is it",
      "when did it come in",
      "is it wild or farmed",
      "does it smell fishy",
      "can you clean it for me",
      "what's good today",
      "what's in season",
      "how do I cook this",
      "will it last until tomorrow",
      "is this safe for sushi"
    ],
    "preparation_terms": [
      "filleted",
      "butterflied",
      "scaled and gutted",
      "pin bones removed",
      "skin-on",
      "skin-off",
      "steaks",
      "portions",
      "whole dressed",
      "cleaned"
    ],
    "shopping_language": [
      "what's fresh today",
      "what just came in",
      "do you have any",
      "can I smell it",
      "let me see the eyes",
      "I need it for tonight",
      "what do you recommend",
      "how much per pound",
      "can you cut me a piece",
      "I'll take that one"
    ]
  },
  "power_words": {
    "freshness": [
      "today's catch",
      "morning delivery",
      "dock-to-door",
      "hours-old",
      "just landed",
      "ice-cold",
      "pristine",
      "glistening",
      "peak freshness",
      "same-day"
    ],
    "quality": [
      "premium",
      "select",
      "choice",
      "hand-selected",
      "restaurant-quality",
      "sushi-grade",
      "pristine",
      "superior",
      "finest",
      "top-grade"
    ],
    "trust": [
      "guaranteed fresh",
      "moneyback promise",
      "family-owned",
      "trusted since",
      "expert fishmongers",
      "locally-sourced",
      "traceable",
      "certified",
      "sustainable",
      "honest"
    ],
    "experience": [
      "expert cut",
      "custom preparation",
      "cooking tips included",
      "recipe suggestions",
      "personalized service",
      "knowledgeable staff",
      "prepared your way",
      "professional filleting",
      "tailored portions",
      "chef-recommended"
    ],
    "urgency": [
      "limited daily supply",
      "today only",
      "while it lasts",
      "seasonal catch",
      "small batch",
      "first come",
      "selling fast",
      "peak season",
      "rare find",
      "won't last"
    ]
  },
  "avoid_words": {
    "overused_retail": [
      "deal",
      "sale",
      "discount",
      "cheap",
      "bargain",
      "clearance",
      "liquidation",
      "blowout",
      "amazing",
      "incredible"
    ],
    "creates_doubt": [
      "frozen",
      "previously frozen",
      "thawed",
      "defrosted",
      "old",
      "yesterday's",
      "leftover",
      "remaining",
      "last chance",
      "final"
    ],
    "vague_claims": [
      "best",
      "finest",
      "world-class",
      "unbeatable",
      "premium quality",
      "top-notch",
      "superior",
      "excellent",
      "perfect",
      "ideal"
    ],
    "pushy_language": [
      "buy now",
      "limited time",
      "act fast",
      "don't miss out",
      "hurry",
      "last chance",
      "going fast",
      "almost gone",
      "final opportunity",
      "must buy"
    ],
    "industrial_terms": [
      "product",
      "inventory",
      "stock",
      "units",
      "merchandise",
      "goods",
      "items",
      "SKU",
      "lot",
      "batch"
    ]
  },
  "headline_templates": {
    "freshness_focused": [
      "Caught This Morning: [FISH TYPE] from [LOCATION]",
      "[DAY]'s Fresh Catch: [FISH VARIETIES]",
      "Just Off the Boat: [FISH TYPE] Arrived at [TIME]",
      "Never Frozen [FISH TYPE] - Delivered [TIMEFRAME]",
      "Today's Dock Delivery: [FISH SELECTION]"
    ],
    "quality_driven": [
      "Sushi-Grade [FISH TYPE] - Hand-Selected by Our Experts",
      "Wild-Caught [FISH TYPE] from [WATERS/REGION]",
      "Line-Caught [FISH TYPE] - Sustainably Sourced",
      "Restaurant-Quality [FISH TYPE] at Market Prices",
      "Premium [FISH TYPE] - [PREPARATION] to Your Specs"
    ],
    "problem_solution": [
      "Don't Know How to Cook [FISH TYPE]? We'll Show You",
      "Need [FISH TYPE] for Tonight? We'll Prep It While You Shop",
      "Wondering What's Fresh? Ask Our Fishmongers",
      "Looking for [SPECIFIC FISH]? We Source It Fresh",
      "Want It Filleted? We'll Cut It Your Way"
    ],
    "seasonal_timely": [
      "[SEASON] [FISH TYPE] - Peak Flavor Right Now",
      "Local [FISH TYPE] Season Has Arrived",
      "[FISH TYPE] Is Running - Limited Daily Catch",
      "First [FISH TYPE] of the Season from [LOCATION]",
      "Peak Season [FISH TYPE] - Best Quality of the Year"
    ],
    "trust_building": [
      "Family-Owned Fish Market Since [YEAR]",
      "Your Fishmongers for [NUMBER] Generations",
      "Fresh Guarantee: Love It or Your Money Back",
      "Direct from [LOCAL DOCKS] to Our Counter",
      "Same Standards We Use for Our Own Family Dinners"
    ]
  },
  "cta_templates": {
    "soft": [
      "Stop by and see today's catch",
      "Ask our fishmongers what's fresh",
      "Come smell the difference",
      "Check out what just arrived",
      "See what's good today",
      "Browse today's selection",
      "Get cooking tips from our experts",
      "Learn more about our daily catches"
    ],
    "medium": [
      "Reserve your [FISH TYPE] for pickup",
      "Call ahead to hold today's [FISH TYPE]",
      "Pre-order for [DAY/EVENT]",
      "Let us prepare it while you shop",
      "Get it cleaned and ready to cook",
      "Have us fillet it your way",
      "Order your [OCCASION] seafood now",
      "Request custom cuts and portions"
    ],
    "hard": [
      "Get today's catch before it's gone",
      "Order now for same-day preparation",
      "Call [PHONE] to secure your selection",
      "Visit by [TIME] for best selection",
      "Place your order for [DAY] pickup",
      "Reserve your [AMOUNT] now",
      "Buy today's [FISH TYPE] while available",
      "Claim your portion before we sell out"
    ]
  },
  "value_propositions": {
    "primary": [
      "Fresh fish delivered daily from local docks - never frozen, never more than 24 hours old",
      "Expert fishmongers who clean, fillet, and prepare your fish exactly how you want it",
      "Sustainable, traceable seafood with full transparency on where and how it was caught",
      "Restaurant-quality fish at market prices - same suppliers as top local chefs",
      "Freshness guarantee: if it doesn't look and smell ocean-fresh, we won't sell it"
    ],
    "supporting": [
      "Free cooking advice and recipe suggestions with every purchase",
      "Custom cuts and portions prepared while you shop",
      "Seasonal catches you won't find at grocery stores",
      "Direct relationships with local fishermen and trusted suppliers",
      "Same-day service - order in the morning, pick up prepared in the afternoon",
      "Knowledgeable staff who can identify, recommend, and teach preparation methods",
      "Wild-caught and sustainably-sourced options clearly labeled",
      "Special orders for events, parties, and holidays"
    ]
  },
  "messaging_frameworks": {
    "freshness_first": {
      "hook": "Our [FISH TYPE] was swimming in [LOCATION] [TIMEFRAME] ago",
      "proof": "Delivered direct from [SOURCE] at [TIME] this morning",
      "benefit": "Taste the difference that true freshness makes",
      "action": "See today's catch and ask our fishmongers anything"
    },
    "expertise_matters": {
      "hook": "Not sure how to cook [FISH TYPE]? Our fishmongers live for this",
      "proof": "[NUMBER] years combined experience, [FAMILY/TRAINING] tradition",
      "benefit": "Get expert preparation, cooking tips, and recipe ideas included",
      "action": "Bring us your questions - we'll send you home confident"
    },
    "quality_transparency": {
      "hook": "Know exactly where your fish came from and how it was caught",
      "proof": "Full traceability from [SPECIFIC WATERS] to our counter",
      "benefit": "Make informed choices about sustainability and quality",
      "action": "Ask to see our sourcing information for any fish"
    },
    "service_convenience": {
      "hook": "We'll prepare your [FISH TYPE] exactly how you need it",
      "proof": "Filleted, scaled, portioned, butterflied - any cut, any way",
      "benefit": "Walk in with a recipe, walk out with ready-to-cook fish",
      "action": "Tell us how you're cooking it, we'll prep it perfectly"
    },
    "trust_guarantee": {
      "hook": "If it's not fresh enough for our family, we won't sell it to yours",
      "proof": "[FAMILY NAME] guarantee since [YEAR] - your money back if not satisfied",
      "benefit": "Shop with complete confidence in every purchase",
      "action": "Experience the difference a true fish market makes"
    }
  },
  "trust_signals": {
    "certifications": [
      "HACCP (Hazard Analysis Critical Control Points) Certified",
      "MSC (Marine Stewardship Council) Certified Sustainable Seafood",
      "ASC (Aquaculture Stewardship Council) Certification",
      "Best Aquaculture Practices (BAP) Certification",
      "FDA Registered Seafood Facility",
      "Local Health Department A-Grade Rating",
      "Safe Quality Food (SQF) Level 2 or 3 Certification",
      "Ocean Wise Recommended Partner",
      "Monterey Bay Aquarium Seafood Watch Partner"
    ],
    "guarantees": [
      "Fresh Fish Daily or Your Money Back",
      "Caught/Delivered Within [24-48] Hours Guarantee",
      "Sustainable Sourcing Promise",
      "Temperature-Controlled Throughout Supply Chain",
      "No Smell, No Sale - Freshness Guarantee",
      "Clear Eyes, Firm Flesh Quality Standard",
      "Traceability from Boat to Counter",
      "Same-Day Fillet Service Available",
      "Ice Bed Display Maintained Below 32°F"
    ],
    "credibility_markers": [
      "Family-Owned Since [YEAR]",
      "Direct Relationships with [LOCAL/REGIONAL] Fishermen",
      "In-House Master Fish Cutter/Monger",
      "Daily Delivery from [SPECIFIC DOCKS/PORTS]",
      "Featured in [LOCAL FOOD PUBLICATIONS]",
      "[X] Generations of Seafood Expertise",
      "Member of National Fisheries Institute",
      "Supplier to Top Local Restaurants",
      "Active Participation in Local Fish Auctions"
    ],
    "transparency_elements": [
      "Catch Date Displayed on Every Product",
      "Origin Location (Wild/Farm) Clearly Labeled",
      "Fishing Method Disclosed (Line-Caught, Net, etc.)",
      "Daily Catch Board with Boat Names",
      "Live Tank Visibility for Shellfish",
      "Open Filleting Counter - Watch Your Fish Prepared",
      "Price Per Pound Posted Prominently",
      "Mercury Level Information Available on Request"
    ]
  },
  "social_proof_statistics": {
    "customer_volume": [
      "Serving [500+] Customers Weekly",
      "[X,000] Pounds of Fresh Fish Sold Monthly",
      "[X] Repeat Customers Since Opening",
      "Processing [50-100] Custom Orders Daily"
    ],
    "freshness_metrics": [
      "New Deliveries [6] Days Per Week",
      "Average Fish Age: [24-72] Hours from Catch",
      "[95%+] of Stock Sold Within 48 Hours",
      "Ice Replaced Every [4-6] Hours"
    ],
    "sustainability_stats": [
      "[80%+] of Inventory from Sustainable Sources",
      "[X] MSC/ASC Certified Products in Stock",
      "Partnered with [X] Local Sustainable Fisheries",
      "Zero Endangered Species Sold Policy"
    ],
    "expertise_indicators": [
      "[X] Years Combined Staff Experience",
      "[X] Professional Fish Mongers on Staff",
      "Staff Trained in [40+] Fish Species Identification",
      "[X] Filleting Techniques Mastered"
    ],
    "variety_metrics": [
      "[30-50+] Fresh Fish Varieties Daily",
      "[15-20+] Shellfish Options Available",
      "Seasonal Specialties Rotate [Weekly/Monthly]",
      "[X] Hard-to-Find Species in Stock"
    ]
  },
  "quality_indicators": {
    "visual_inspection": [
      "Clear, Bright, Bulging Eyes (Not Sunken or Cloudy)",
      "Shiny, Metallic Skin with Vibrant Color",
      "Firm, Elastic Flesh That Springs Back When Pressed",
      "Bright Red or Pink Gills (Not Brown or Gray)",
      "Intact Scales That Adhere Tightly to Skin",
      "No Discoloration or Browning at Edges",
      "Whole Fish Displayed on Fresh Ice Beds",
      "Fillets Cut to Order, Not Pre-Cut Days Prior"
    ],
    "smell_test": [
      "Fresh Ocean/Sea Breeze Smell - Never Fishy or Ammonia",
      "Sweet, Clean Aroma",
      "No Sour or Pungent Odors",
      "Store Smells Like Salt Air, Not Fish"
    ],
    "texture_standards": [
      "Flesh is Translucent and Moist, Not Milky",
      "No Gaping or Separation in Fillet Segments",
      "Shellfish Shells Tightly Closed or Close When Tapped",
      "Shrimp Firm and Springy, Not Mushy",
      "Oysters Plump with Clear Liquor"
    ],
    "storage_conditions": [
      "Displayed on Crushed Ice, Not in Liquid",
      "Temperature Maintained at 32°F or Below",
      "Separate Storage for Different Species",
      "Covered Display Cases to Prevent Contamination",
      "Live Tanks with Proper Aeration and Filtration",
      "No Cross-Contamination Between Raw and Prepared"
    ],
    "preparation_quality": [
      "Clean, Professional Cutting Techniques",
      "Minimal Waste in Filleting Process",
      "Bones Removed Thoroughly (Pin Bones)",
      "Skin Removed Cleanly When Requested",
      "Custom Cuts Available (Steaks, Portions, Butterfly)",
      "Proper Scaling and Gutting Procedures"
    ],
    "sourcing_transparency": [
      "Able to Name Specific Boat or Farm Source",
      "Catch Date Within Last 24-72 Hours",
      "Wild-Caught vs. Farm-Raised Clearly Identified",
      "Domestic vs. Imported Labeled",
      "Seasonal Availability Matches Natural Cycles"
    ]
  },
  "testimonial_capture_timing": {
    "optimal_moments": [
      "Immediately After First Taste/Cooking at Home (Same Evening)",
      "Within 24 Hours of Purchase While Freshness is Evident",
      "After Successfully Preparing a New/Challenging Species",
      "Following a Special Occasion Meal (Holiday, Dinner Party)",
      "After Receiving Expert Cooking Advice That Worked",
      "When Customer Discovers a New Favorite Fish",
      "After Witnessing Filleting Demonstration"
    ],
    "trigger_events": [
      "Custom Order Completion (Large Party, Whole Fish)",
      "Successful Cooking of Previously Intimidating Species",
      "Positive Comparison to Previous Fish Market Experience",
      "Guest Compliments at Dinner Party",
      "Repeat Purchase Within Same Week",
      "Recommendation from Restaurant Chef Validation",
      "Seasonal Specialty First-Time Purchase Success"
    ],
    "capture_methods": [
      "Follow-Up Text Message Evening of Purchase: 'How did your [FISH] turn out?'",
      "QR Code on Receipt for Quick Review (Incentive: Recipe Card)",
      "In-Store Tablet at Checkout for Immediate Feedback",
      "Email Next Day with Cooking Tips + Review Request",
      "Social Media Photo Contest: 'Show Us Your Dish'",
      "Loyalty Program Points for Verified Reviews",
      "Fishmonger Personal Follow-Up for Custom Orders"
    ],
    "review_focus_areas": [
      "Freshness Upon Opening Package at Home",
      "Ease of Preparation/Cleaning",
      "Taste and Texture After Cooking",
      "Staff Knowledge and Helpfulness",
      "Value Compared to Grocery Store Seafood Counter",
      "Accuracy of Cooking Time Recommendations",
      "Sustainability and Sourcing Transparency"
    ]
  },
  "competitive_advantages": {
    "sourcing_differentiation": [
      "Direct Dock Buying - No Middleman Markup",
      "Exclusive Relationships with [SPECIFIC] Day Boat Fishermen",
      "First Access to Premium Catches at Local Auctions",
      "Private Label Sustainable Farm Partnerships",
      "Seasonal Wild-Caught Specialties Not Available Elsewhere",
      "Ability to Source Rare/Exotic Species on Request",
      "Traceability to Specific Boat and Captain"
    ],
    "expertise_advantages": [
      "Multi-Generational Fish Cutting Expertise",
      "Staff Can Identify Fish by Species, Not Just Generic Names",
      "Custom Preparation Services (Stuffing, Marinating, Seasoning)",
      "Free Cooking Classes or Demonstrations",
      "Recipe Recommendations Based on Cooking Method and Skill Level",
      "Shellfish Shucking Service While You Wait",
      "Portion Sizing Guidance for Events and Gatherings"
    ],
    "freshness_superiority": [
      "Multiple Daily Deliveries vs. Competitor's Weekly",
      "Never Frozen Policy on [SPECIFIC SPECIES]",
      "Same-Day Catch Available on Select Items",
      "Strict 48-Hour Sell-Through Policy",
      "Live Tanks for Lobster, Crab, and Shellfish",
      "Visible Ice Replacement Schedule",
      "Temperature Monitoring Systems with Alerts"
    ],
    "service_differentiation": [
      "Free Filleting and Cleaning on All Purchases",
      "Custom Cutting to Your Specifications",
      "Advance Ordering for Specific Species or Sizes",
      "Home Delivery with Insulated Packaging",
      "Cooking Instruction Included with Purchase",
      "Complementary Recipe Cards for Each Species",
      "Phone/Text Consultation Before Shopping"
    ],
    "value_propositions": [
      "Restaurant-Quality at Retail Prices",
      "Less Waste Due to Expert Preparation",
      "Loyalty Program with Meaningful Rewards",
      "Bulk Pricing for Large Orders or Events",
      "Price Matching on Comparable Quality (Not Inferior Products)",
      "Seasonal Sales on Peak-Freshness Items",
      "Free Items with Purchase (Lemon, Herbs, Cooking Tips)"
    ],
    "sustainability_leadership": [
      "Higher Percentage of Certified Sustainable Options Than Competitors",
      "Transparent Sourcing Information Available on Every Product",
      "Refusal to Sell Overfished or Endangered Species",
      "Educational Materials on Sustainable Choices",
      "Partnerships with Ocean Conservation Organizations",
      "Seasonal Eating Promotion to Reduce Environmental Impact",
      "Eco-Friendly Packaging Options Available"
    ]
  },
  "success_metrics": {
    "customer_retention": [
      "Weekly Repeat Customer Rate: [60-75%]",
      "Monthly Active Customers: [X,XXX]",
      "Average Customer Lifespan: [X] Years",
      "Referral Rate: [30-40%] of New Customers"
    ],
    "quality_metrics": [
      "Product Return Rate: [<1%]",
      "Freshness Guarantee Claims: [<0.5%]",
      "Health Inspection Score: [95-100]",
      "Same-Day Sellthrough Rate: [70-85%]"
    ],
    "operational_excellence": [
      "Daily Inventory Turnover: [X] Times Per Week",
      "Waste Percentage: [<5%] of Total Inventory",
      "On-Time Delivery Rate: [98%+]",
      "Order Accuracy: [99%+]"
    ],
    "customer_satisfaction": [
      "Average Review Rating: [4.5-5.0] Stars",
      "Net Promoter Score: [60-80]",
      "Customer Complaint Resolution Rate: [95%+]",
      "Social Media Engagement Rate: [X%]"
    ],
    "business_growth": [
      "Year-Over-Year Customer Growth: [15-25%]",
      "Average Transaction Value: $[XX-XXX]",
      "Custom Order Volume Growth: [X%] Annually",
      "Market Share in Local Area: [X%]"
    ]
  },
  "hook_library": {
    "curiosity": [
      "The [fish species] mistake that's costing you [dollar amount] every time you shop at the seafood counter...",
      "What your fishmonger isn't telling you about [frozen vs. fresh/farmed vs. wild/imported fish]...",
      "The secret [color/texture/smell] test that reveals if your [fish type] is actually fresh or days old...",
      "Why [specific fish] from [location] tastes completely different than what you've been buying...",
      "The hidden reason your [grilled/baked/fried] fish never tastes like restaurant quality...",
      "What happens behind the scenes at [time] every morning that determines your fish selection..."
    ],
    "authority": [
      "After [number] years cutting fish at [market name], here's what I look for when buying [fish type]...",
      "As a [third/fourth]-generation fishmonger, this is the only way to select [shellfish/whole fish]...",
      "I've filleted over [number] [fish species] and here's the [technique/secret] professionals use...",
      "Former [commercial fisherman/seafood buyer] reveals the truth about [fishing method/grading system]...",
      "Trained by [master fishmonger/sushi chef], here's how to tell [quality indicator] in [seconds/one glance]...",
      "Working with [restaurant/chef clients] for [number] years taught me this about [seafood selection]..."
    ],
    "pain_point": [
      "Tired of [fish type] that falls apart on the grill? The problem is [buying mistake/preparation error]...",
      "Stop wasting money on [shellfish/fish] that smells [fishy/like ammonia] by [day number]...",
      "Your [salmon/tuna/cod] shouldn't taste [muddy/bland/rubbery] - here's what's going wrong...",
      "Hate when the fishmonger gives you [looks/attitude] for asking about [freshness/sourcing]? Here's why...",
      "If your [seafood type] always [overcooks/undercooks/sticks to the pan], you're buying the wrong [cut/grade/size]...",
      "The frustrating truth about why [grocery store fish/pre-packaged seafood] never tastes [fresh/like advertised]..."
    ],
    "transformation": [
      "From avoiding the fish counter to cooking [fish type] [number] times a week - here's what changed...",
      "How switching from [farmed/Atlantic] to [wild/Pacific] [fish species] transformed my [health/cooking/budget]...",
      "I went from [throwing away/overcooking] fish to [perfect results] using this [selection/storage] method...",
      "Before: Paying [dollar amount] for [mediocre/grocery store] fish. After: [better quality] for [less money] by [doing this]...",
      "My family went from [fish haters/picky eaters] to requesting [fish type] after I learned [this technique]...",
      "Transformed my [weeknight dinners/meal prep] by understanding [this] about [frozen/fresh] seafood..."
    ],
    "urgency": [
      "[Fish species] season ends [timeframe] - here's what to buy before [price increase/availability drops]...",
      "Only [number] hours between [catch/delivery] and when fish starts losing [freshness/quality] - here's what to do...",
      "[Specific fish/shellfish] is at peak [flavor/price/quality] for [number] more weeks - don't miss [this]...",
      "The [day of week] morning delivery that serious seafood buyers plan their week around...",
      "Before [holiday/event], prices on [shellfish/fish type] jump [percentage] - stock up now on [these items]...",
      "[Weather event/season change] is about to impact [fish availability/pricing] - here's your [number]-day plan..."
    ],
    "social_proof": [
      "How [local restaurants/chefs] are using this [lesser-known fish/technique] to create [signature dishes]...",
      "[Number] customers switched to [buying method/fish type] after learning [this fact]...",
      "The [fish species/preparation] that [number]% of our [regular/professional] customers request by name...",
      "Why [demographic] customers keep coming back for [specific product/service] every [frequency]...",
      "[Chef/customer name] built their [signature dish/reputation] using [fish type] from [source/method]...",
      "What [number] five-star reviews taught us about [customer preference/quality indicator] in [seafood category]..."
    ],
    "controversy": [
      "Why I refuse to sell [popular fish] despite [everyone else/competitors] carrying it...",
      "The [certification/label] that the seafood industry doesn't want you to understand about [sustainability/origin]...",
      "[Farmed/Wild/Imported] [fish type] isn't actually [worse/better] - here's what really matters...",
      "Stop believing [common advice] about [seafood storage/thawing/cooking] - it's ruining your [fish type]...",
      "The controversial truth: [cheaper/expensive] [fish species] is often [fresher/better quality] than [premium option]...",
      "Why [traditional/popular] advice about [fish eyes/gills/smell] doesn't work at [modern markets/grocery stores]..."
    ],
    "question": [
      "Can you actually taste the difference between [day-boat/net-caught/line-caught] [fish species]?",
      "Is [dollar amount] per pound for [fish type] a good deal or are you overpaying?",
      "Should you buy [whole fish/fillets/steaks] if you want [best value/freshness/convenience]?",
      "What's the real difference between [sushi-grade/premium/regular] [tuna/salmon] beyond the price?",
      "How can [two markets/vendors] sell the same [fish species] with [dollar amount] price difference?",
      "Why does [fish type] from [location/season] taste completely different than [other source]?"
    ],
    "statistic": [
      "[Percentage]% of [fish type] sold as [fresh/wild/local] is actually [frozen/farmed/imported] - here's how to tell...",
      "The average [fish/shellfish] travels [number] miles before reaching your plate - except [this option]...",
      "[Fish species] loses [percentage]% of its [flavor/texture/nutrients] after [number] days - here's the [number]-day rule...",
      "Only [percentage]% of shoppers know to check [specific indicator] when buying [seafood type]...",
      "[Seafood type] prices fluctuate [percentage]% between [day/season] - time your purchase for [savings amount]...",
      "Americans waste [dollar amount/percentage] on [seafood category] by not knowing [storage/selection] basics..."
    ],
    "story": [
      "The [time] morning I watched a [fisherman/vendor] reject [number] pounds of [fish type] because of [quality issue]...",
      "A [customer/chef] once asked me for [unusual fish/specific cut] and it changed how I [source/display/recommend] seafood...",
      "My [grandfather/mentor] taught me to [test/select] [fish type] using [method] - [number] years later, it's still [accurate/relevant]...",
      "The day I discovered [fish species/technique] at [location/market] and realized everything I knew about [seafood] was wrong...",
      "Watching [number] customers walk past [underrated fish] to buy [overpriced alternative] inspired me to [action]...",
      "After [event/experience] with [spoiled/amazing] [seafood type], I developed this [number]-step [selection/storage] system..."
    ]
  },
  "campaign_templates": {
    "awareness": {
      "name": "Fresh Catch Awareness Campaign",
      "duration": "4 weeks",
      "posts_per_week": 5,
      "industry_themes": [
        "Daily fresh catch arrivals",
        "Sustainable fishing practices",
        "Fish preparation tips and techniques",
        "Seasonal seafood availability",
        "Ocean-to-table freshness guarantee",
        "Local fishing community stories"
      ],
      "content_mix": {
        "educational": 50,
        "promotional": 20,
        "engagement": 30
      },
      "sample_posts": [
        {
          "day": 1,
          "type": "educational",
          "hook": "🐟 Not sure if your fish is fresh? Here's what the pros look for:",
          "body": "Clear, bright eyes (not cloudy), firm flesh that springs back when touched, and a clean ocean smell - never fishy or ammonia-like. Our fishmongers inspect every delivery using these exact standards before it reaches our counter.",
          "cta": "Visit us today and see the difference fresh really means!"
        },
        {
          "day": 2,
          "type": "engagement",
          "hook": "Question: What's your go-to weeknight fish dinner? 🍽️",
          "body": "We're always curious what our customers are cooking up! Whether it's a quick pan-seared salmon or classic fish tacos, we want to hear your favorites. Drop your answer below and we might feature it in our recipe series!",
          "cta": "Comment below with your favorite recipe!"
        },
        {
          "day": 3,
          "type": "educational",
          "hook": "🌊 Ever wonder what 'sustainable fishing' actually means?",
          "body": "It means fish populations can replenish naturally, fishing methods don't harm ocean habitats, and fishermen earn fair wages. We partner only with certified sustainable fisheries because healthy oceans mean fresh fish for generations to come.",
          "cta": "Ask our team about the story behind any fish in our case!"
        },
        {
          "day": 4,
          "type": "promotional",
          "hook": "🎣 TODAY'S CATCH just arrived: Wild-caught [SPECIES] from [LOCATION]!",
          "body": "Our boat came in this morning with beautiful [SPECIES] - perfect for grilling, baking, or your favorite preparation. Limited quantity available, and at this quality, it won't last long.",
          "cta": "Stop by before 6pm to get first pick!"
        },
        {
          "day": 5,
          "type": "educational",
          "hook": "The #1 mistake people make when cooking fish at home? 🔥",
          "body": "Overcooking! Fish continues cooking after you remove it from heat, so take it off when it's slightly underdone. For most fish, cook until it flakes easily and reaches 145°F internal temp - then let it rest for 2 minutes.",
          "cta": "Save this tip for your next seafood dinner!"
        },
        {
          "day": 6,
          "type": "engagement",
          "hook": "🦐 Shellfish lovers: Team Shrimp or Team Crab? (No wrong answers!)",
          "body": "We're settling this debate once and for all! Cast your vote below and tell us your favorite way to enjoy it. Bonus points if you share your secret preparation method!",
          "cta": "Vote in the comments and tag a fellow seafood lover!"
        },
        {
          "day": 7,
          "type": "educational",
          "hook": "🧊 Why we keep our fish on ice, not in it:",
          "body": "Direct contact with ice can damage delicate fish flesh and create a watery texture. We display our fish ON crushed ice beds with proper drainage, maintaining perfect temperature while preserving texture and flavor. It's details like this that keep our fish market-fresh.",
          "cta": "Come see our display standards in person - we're proud to show them off!"
        }
      ]
    },
    "conversion": {
      "name": "Hook More Customers Campaign",
      "duration": "3 weeks",
      "posts_per_week": 6,
      "industry_themes": [
        "First-time customer specials",
        "Filleting and preparation services",
        "Weekly seafood specials",
        "Easy cooking solutions for busy families",
        "Quality comparison vs grocery stores",
        "Customer success stories"
      ],
      "content_mix": {
        "educational": 30,
        "promotional": 45,
        "engagement": 25
      },
      "sample_posts": [
        {
          "day": 1,
          "type": "promotional",
          "hook": "🎉 Never shopped at a fish market before? Here's our First-Timer Special:",
          "body": "$5 off any purchase over $25 this week! Plus, our fishmongers will give you personalized cooking recommendations for whatever you choose. No more intimidation - just fresh fish and friendly advice.",
          "cta": "Show this post at checkout to claim your discount!"
        },
        {
          "day": 2,
          "type": "social_proof",
          "hook": "⭐ 'I'll never buy grocery store fish again!' - Sarah M.",
          "body": "After trying our wild-caught salmon, Sarah became a weekly regular. She says the difference in taste and texture is 'like comparing a fresh tomato to a canned one.' Hundreds of customers have made the switch - and they never look back.",
          "cta": "Ready to taste the difference? Visit us this week!"
        },
        {
          "day": 3,
          "type": "promotional",
          "hook": "⏰ Too busy to prep fish? We'll do it for FREE!",
          "body": "Every purchase includes complimentary filleting, scaling, deboning, and portioning. Buy a whole fish, leave with ready-to-cook fillets. It's like having a personal chef prep your seafood - no extra charge, no hassle.",
          "cta": "Order ahead for same-day pickup: [PHONE NUMBER]"
        },
        {
          "day": 4,
          "type": "educational",
          "hook": "💰 Think fish markets are expensive? Let's do the math:",
          "body": "Our salmon is $16.99/lb vs. grocery store $14.99/lb. BUT - ours has zero waste (we trim it free), superior freshness (lasts 3+ days longer), and better yield per pound. You actually save money AND get better quality.",
          "cta": "Try a side-by-side comparison - we're confident you'll taste the value!"
        },
        {
          "day": 5,
          "type": "promotional",
          "hook": "🔥 FLASH DEAL: [SPECIES] at [X]% off - TODAY ONLY!",
          "body": "We got an exceptional delivery this morning and we're passing the savings to you. Perfect for [COOKING METHOD], feeds a family of 4 for under $[PRICE]. Available while supplies last - and trust us, this price won't last past closing time.",
          "cta": "Get here before we sell out! Open until [TIME]"
        },
        {
          "day": 6,
          "type": "engagement",
          "hook": "🍽️ What's stopping you from cooking more fish at home?",
          "body": "Is it the prep work? Not knowing how to cook it? Worried about smell? We solve all these problems! Tell us your biggest seafood cooking challenge and we'll share our expert solution.",
          "cta": "Drop your concern below and let us help!"
        },
        {
          "day": 7,
          "type": "promotional",
          "hook": "📦 NEW: Pre-portioned Family Meal Packs - Dinner solved!",
          "body": "4 portions of fresh [SPECIES], pre-seasoned and ready to cook in 15 minutes. Includes cooking instructions and side dish suggestions. $[PRICE] feeds the whole family - healthier and cheaper than takeout.",
          "cta": "Pre-order your meal pack for pickup tomorrow: [LINK/PHONE]"
        }
      ]
    },
    "retention": {
      "name": "Loyal Catch Keeper Program",
      "duration": "ongoing",
      "posts_per_week": 4,
      "industry_themes": [
        "Weekly regulars recognition",
        "Advanced cooking techniques",
        "Exclusive early access to premium catches",
        "Seasonal recipe collections",
        "Behind-the-scenes market operations",
        "VIP customer appreciation"
      ],
      "content_mix": {
        "educational": 40,
        "promotional": 30,
        "engagement": 30
      },
      "sample_posts": [
        {
          "day": 1,
          "type": "engagement",
          "hook": "👋 Shout out to our regulars! How long have you been shopping with us?",
          "body": "Some of you have been coming in since we opened [X] years ago, and we never take your loyalty for granted. Share your story below - when did you first discover us and what keeps you coming back?",
          "cta": "Long-time customers: comment below and get a surprise next visit!"
        },
        {
          "day": 2,
          "type": "educational",
          "hook": "🔪 Master Class: How to properly sharpen your filleting knife",
          "body": "A sharp knife is safer and makes cleaner cuts. Use a whetstone at a 15-20 degree angle, working from base to tip in smooth strokes. Hone regularly between sharpenings. Our fishmongers sharpen daily - it's why our fillets look so perfect.",
          "cta": "Want a live demo? Ask any team member during your next visit!"
        },
        {
          "day": 3,
          "type": "promotional",
          "hook": "🌟 VIP ALERT: Premium [SPECIES] arriving Thursday - reserve yours now!",
          "body": "We're getting a limited shipment of exceptional [SPECIES] from [LOCATION]. Our loyal customers get first dibs before we open it to the public Friday. This is restaurant-quality fish at market prices.",
          "cta": "Text 'RESERVE' to [NUMBER] or call us to secure your portion!"
        },
        {
          "day": 4,
          "type": "educational",
          "hook": "🧂 Advanced technique: Dry-brining fish for restaurant-quality results",
          "body": "Salt your fish 30-45 minutes before cooking (not overnight like meat). This draws out moisture, concentrates flavor, and creates an incredible crust. Pat dry before cooking. Try it on our [SPECIES] this weekend - you'll be amazed.",
          "cta": "Ask us which fish work best for dry-brining!"
        },
        {
          "day": 5,
          "type": "engagement",
          "hook": "📸 Show us what you made! Customer creation feature:",
          "body": "Tag us in your seafood creations and you might be featured in our weekly spotlight! We love seeing how you prepare the fish you buy from us. Plus, featured posts get a $10 credit toward their next purchase!",
          "cta": "Tag us @[HANDLE] with #[MARKETNAME]Catch in your next post!"
        },
        {
          "day": 6,
          "type": "promotional",
          "hook": "💎 Loyalty Reward: Every 10th purchase gets [X]% off!",
          "body": "Already shopping here weekly? You're earning rewards automatically! Every tenth visit, you'll receive [X]% off your entire purchase. It's our way of saying thank you for making us your trusted fish market.",
          "cta": "Ask at checkout about your loyalty status!"
        },
        {
          "day": 7,
          "type": "educational",
          "hook": "🌊 Behind the scenes: How we select our suppliers",
          "body": "Every supplier must meet our strict standards: sustainable certifications, traceability documentation, and consistent quality scores. We personally visit facilities and taste-test before partnering. Your trust means everything, so we never compromise on sourcing.",
          "cta": "Have questions about where your fish comes from? We have answers!"
        }
      ]
    },
    "seasonal": {
      "name": "Summer Grilling Season Spectacular",
      "duration": "8 weeks",
      "posts_per_week": 5,
      "industry_themes": [
        "Best fish for grilling",
        "Summer seafood recipes",
        "BBQ preparation techniques",
        "Peak season availability",
        "Outdoor entertaining with seafood",
        "Grilling accessories and tools"
      ],
      "content_mix": {
        "educational": 35,
        "promotional": 40,
        "engagement": 25
      },
      "sample_posts": [
        {
          "day": 1,
          "type": "promotional",
          "hook": "🔥 GRILLING SEASON IS HERE! Summer Seafood Specials start today:",
          "body": "Stock up on grill-perfect favorites: Swordfish steaks, jumbo shrimp, salmon fillets, and whole snapper. Special pricing all summer long, plus we're sharing our secret marinades with every purchase. Time to make your backyard the best restaurant in town!",
          "cta": "Visit us this weekend to kick off grilling season right!"
        },
        {
          "day": 2,
          "type": "educational",
          "hook": "🐟 The 5 BEST fish for grilling (and why):",
          "body": "Swordfish, tuna, salmon, mahi-mahi, and snapper all have firm flesh that won't fall apart on the grill. They hold up to high heat, develop beautiful char marks, and stay moist inside. Pro tip: oil the fish, not the grates, for perfect release.",
          "cta": "Grab any of these today - we'll share our grilling time guide!"
        },
        {
          "day": 3,
          "type": "engagement",
          "hook": "⚔️ DEBATE: Grilling fish in foil or directly on grates?",
          "body": "Our team is split on this! Foil keeps it moist and makes cleanup easy, but direct grilling gives you those gorgeous char marks and smoky flavor. What's your method and why?",
          "cta": "Defend your grilling method in the comments!"
        },
        {
          "day": 4,
          "type": "promotional",
          "hook": "🎉 WEEKEND SPECIAL: Build Your Own Seafood Grill Pack!",
          "body": "Choose any 3 items from our grill selection, get 15% off your total. Mix and match: shrimp skewers, fish steaks, scallops, lobster tails - create the perfect spread for your cookout. Available Friday-Sunday only.",
          "cta": "Pre-order for weekend pickup: [PHONE/LINK]"
        },
        {
          "day": 5,
          "type": "educational",
          "hook": "🦐 How to keep shrimp from sticking to the grill (game-changer!):",
          "body": "Thread shrimp through both the head and tail ends - creates a 'C' shape that lays flat and won't spin. Brush with oil, season well, and use medium-high heat. Cook 2-3 minutes per side until pink and slightly charred.",
          "cta": "Grab our jumbo shrimp today - perfect for skewers!"
        },
        {
          "day": 6,
          "type": "promotional",
          "hook": "🌟 NEW: Pre-marinated Grilling Fish - Just unwrap and cook!",
          "body": "Too busy to prep? Try our chef-prepared marinated options: Citrus-Herb Salmon, Cajun Swordfish, or Garlic-Butter Shrimp. Already seasoned, already delicious - just 10 minutes on the grill. $[PRICE] per portion.",
          "cta": "Order yours for tonight's dinner: [CONTACT]"
        },
        {
          "day": 7,
          "type": "engagement",
          "hook": "📸 CONTEST: Show us your best grilled seafood photo!",
          "body": "Post your creation, tag us, and use #[MARKETNAME]Grills for a chance to win a $50 credit! We'll choose 3 winners based on presentation, creativity, and mouth-watering appeal. Contest runs through [DATE].",
          "cta": "Start grilling and start posting - we can't wait to see your skills!"
        }
      ]
    }
  },
  "content_templates": {
    "instagram": {
      "educational": {
        "hook": "🐟 Fish freshness 101: Here's what the pros look for (save this!)",
        "body": "🐟 Fish freshness 101: Here's what the pros look for (save this!)\n\nSwipe to learn the 5 signs of truly fresh fish →\n\n1️⃣ EYES: Should be clear, bright, and slightly bulging. Cloudy or sunken? Pass.\n\n2️⃣ GILLS: Bright red or pink means fresh. Brown or gray means it's been sitting.\n\n3️⃣ SMELL: Fresh fish smells like the ocean, NOT fishy. Trust your nose!\n\n4️⃣ FLESH: Should bounce back when pressed. If it stays indented, keep looking.\n\n5️⃣ SKIN: Shiny and metallic with tight scales. Dull skin = old fish.\n\n💡 Pro tip: [SPECIFIC_TIP_ABOUT_YOUR_MARKET]\n\nQuestions? Drop them below! Our fishmongers love helping you pick the perfect catch.\n\n#FreshFish #SeafoodTips #FishMarket #CookingTips #SeafoodLovers #FreshCatch #FishMonger #SeafoodEducation #KitchenTips",
        "cta": "Save this post for your next fish shopping trip! 📌"
      },
      "authority": {
        "hook": "After 20+ years in the fish business, here's what I wish every customer knew...",
        "body": "After 20+ years in the fish business, here's what I wish every customer knew...\n\n🌊 THE TRUTH ABOUT \"FRESH\" FISH:\n\nMost grocery stores get deliveries 2-3x per week. We get ours [DELIVERY_FREQUENCY]. That's the difference between fish that's been sitting and fish that was swimming [TIMEFRAME_AGO].\n\n🎣 WHY IT MATTERS:\n• Better flavor (no \"fishy\" taste)\n• Longer shelf life in your fridge\n• More nutrients intact\n• Safer for raw preparations\n\n📍 What makes us different:\n[UNIQUE_SOURCING_PRACTICE]\n\nWe don't just sell fish—we're obsessed with it. Every fillet is hand-cut, every piece is inspected, and if we wouldn't serve it to our families, it doesn't make it to our counter.\n\nThat's the [YOUR_MARKET_NAME] difference.\n\n#FreshSeafood #FishMarket #SustainableSeafood #LocalBusiness #QualityMatters #SeafoodExperts #FreshDaily",
        "cta": "Visit us this week and taste the difference fresh makes 🐟"
      },
      "case_study": {
        "hook": "\"I never cooked fish at home until I met these guys\" - Here's Sarah's story 👇",
        "body": "\"I never cooked fish at home until I met these guys\" - Here's Sarah's story 👇\n\n🙋‍♀️ THE PROBLEM:\nSarah loved seafood at restaurants but was terrified of cooking it at home. Overcooked. Smelly kitchen. Wasted money.\n\n💡 WHAT CHANGED:\nShe stopped by our counter and asked for help. Our team:\n✅ Recommended [BEGINNER_FRIENDLY_FISH]\n✅ Showed her the freshness signs\n✅ Gave her a foolproof 15-min recipe\n✅ Shared the one timing trick that changes everything\n\n🎉 THE RESULT:\n\"Now I cook fish 2-3 times a week! My family requests it. I save money vs. dining out, and I actually ENJOY the process. The team at [YOUR_MARKET_NAME] made me feel confident, not intimidated.\"\n\n📸 This is her [DISH_NAME] from last week!\n\n💬 New to cooking fish? We've got you. Stop by and let's find your perfect starter fish.\n\n#SeafoodSuccess #HomeCooked #FishMarket #CookingConfidence #CustomerStory #SeafoodMadeEasy #FreshFish",
        "cta": "Tag someone who needs to try cooking fish at home! 👇"
      },
      "promotional": {
        "hook": "🚨 This weekend only: [FEATURED_FISH] at prices that won't last...",
        "body": "🚨 This weekend only: [FEATURED_FISH] at prices that won't last...\n\nWe just got an incredible catch of [FEATURED_FISH] and we're passing the savings directly to you.\n\n🐟 WEEKEND SPECIAL:\n[FEATURED_FISH]: $[PRICE]/lb (reg. $[REGULAR_PRICE])\n\n✨ WHY YOU'LL LOVE IT:\n• Perfect for [COOKING_METHOD]\n• [FLAVOR_PROFILE] flavor\n• [TEXTURE_DESCRIPTION] texture\n• Ready in under [TIME] minutes\n\n📅 Available: [START_DATE] - [END_DATE]\n📍 While supplies last\n\n💡 RECIPE IDEA:\nTry our [RECIPE_NAME]—we'll give you the recipe card free with purchase!\n\n🏃‍♀️ These won't last. Our [FEATURED_FISH] specials typically sell out by [DAY/TIME].\n\n#WeekendSpecial #FreshSeafood #FishMarket #SeafoodSale #FreshCatch #LocalSeafood #FishDeals #FoodieFriday",
        "cta": "Stop by this weekend! First come, first served 🎣"
      }
    },
    "linkedin": {
      "educational": {
        "hook": "The seafood industry wastes 35% of its catch. Here's how independent fish markets are changing that—and why it matters for your business.",
        "body": "The seafood industry wastes 35% of its catch. Here's how independent fish markets are changing that—and why it matters for your business.\n\nLast week, a restaurant owner asked me why our pricing stays stable while big-box stores fluctuate wildly. The answer reveals everything about supply chain efficiency in specialty retail.\n\nHERE'S WHAT MOST PEOPLE DON'T KNOW:\n\nBig retailers optimize for shelf life and shipping durability, not quality. They need fish that survives 5-7 days in distribution. That requirement eliminates the most delicate, flavorful species and means you're paying for preservation, not freshness.\n\nIndependent fish markets operate differently:\n\n→ Direct relationships with [NUMBER] local fishermen and [NUMBER] trusted suppliers\n→ [DELIVERY_FREQUENCY] deliveries mean faster turnover\n→ Whole fish utilization: fillets, collars, bones for stock, heads for soup\n→ Custom cutting reduces waste by [PERCENTAGE]%\n\nTHE BUSINESS IMPACT:\n\nFor restaurants: [SPECIFIC_BENEFIT_FOR_RESTAURANTS]\nFor retailers: [SPECIFIC_BENEFIT_FOR_RETAILERS]\nFor consumers: [SPECIFIC_BENEFIT_FOR_CONSUMERS]\n\nAt [YOUR_MARKET_NAME], we've reduced waste to under [PERCENTAGE]% through [SPECIFIC_PRACTICE]. Every part of the fish gets used. Nothing gets thrown away that could feed someone.\n\nThis isn't just good ethics—it's good business. Our customers get better quality at competitive prices because we're not subsidizing waste.\n\nThe future of food retail is local, specialized, and efficient. The giants can't compete on relationships and knowledge.\n\nWhat supply chain innovations are you seeing in your industry?",
        "cta": "Follow for more insights on sustainable food retail and supply chain efficiency."
      },
      "authority": {
        "hook": "After two decades in the seafood business, I've watched three major shifts that changed everything. The third one is happening right now.",
        "body": "After two decades in the seafood business, I've watched three major shifts that changed everything. The third one is happening right now.\n\nSHIFT #1 (2005-2010): Sustainability Awakening\nCustomers started asking where fish came from. MSC certification emerged. Bluefin tuna became controversial. We adapted by [SPECIFIC_ACTION_YOU_TOOK].\n\nSHIFT #2 (2011-2018): The Grocery Store Wars\nBig-box retailers invested heavily in seafood departments. Many independent markets closed. We survived by focusing on [YOUR_DIFFERENTIATION_STRATEGY].\n\nSHIFT #3 (2019-Present): The Knowledge Economy\nThis is the most important shift—and the biggest opportunity.\n\nCustomers don't just want fish anymore. They want:\n• Education on preparation techniques\n• Transparency about sourcing\n• Personalized recommendations\n• Recipe development support\n• Confidence that they're making good choices\n\nThe businesses winning right now aren't competing on price. They're competing on expertise.\n\nHERE'S WHAT WE CHANGED:\n\n→ Every team member completes [TRAINING_PROGRAM]\n→ We spend [TIME_AMOUNT] with each customer on average\n→ [PERCENTAGE]% of sales now include a recipe or cooking tip\n→ We track [SPECIFIC_METRIC] to measure education impact\n\nTHE RESULTS:\n• Customer retention up [PERCENTAGE]%\n• Average transaction value increased [AMOUNT]\n• [PERCENTAGE]% of new customers come from referrals\n\nThe lesson for any specialty retail business: Your expertise is your moat. Commodities compete on price. Knowledge commands premium.\n\nWhat shifts are you seeing in your industry? How are you adapting?",
        "cta": "Connect with me to discuss the future of specialty retail and customer education strategies."
      },
      "case_study": {
        "hook": "How a 40-seat restaurant increased seafood sales by 156% in 6 months—without changing their menu prices.",
        "body": "How a 40-seat restaurant increased seafood sales by 156% in 6 months—without changing their menu prices.\n\nLast January, Chef [NAME] from [RESTAURANT_NAME] had a problem:\n\n\"Our seafood dishes had the highest food cost and the lowest sales. Customers ordered them least, sent them back most. We were ready to cut the seafood menu in half.\"\n\nTHE REAL PROBLEM:\nIt wasn't the menu. It was the fish.\n\nThey were buying from a broadline distributor. Fish arrived frozen, sometimes thawed and refrozen. Quality was inconsistent. No wonder customers weren't ordering it.\n\nWHAT WE DID DIFFERENTLY:\n\n→ WEEK 1: Switched to [DELIVERY_FREQUENCY] fresh deliveries\n→ WEEK 2: Introduced [NUMBER] seasonal species they'd never worked with\n→ WEEK 3: Trained kitchen staff on proper handling and storage\n→ WEEK 4: Started custom portioning to reduce waste\n\nWe also did something unusual: invited their entire kitchen team to our facility at 5am to see the receiving process. They met our suppliers. They learned to identify quality. They understood the supply chain.\n\nTHE RESULTS (6 MONTHS):\n\n✓ Seafood sales increased 156%\n✓ Food cost on seafood dropped from 38% to 28%\n✓ Zero seafood dishes sent back (vs. 12-15 monthly before)\n✓ Added 3 new seafood specials due to demand\n✓ Customer reviews mentioning seafood up 200%+\n\nTHE INSIGHT:\n\n\"I thought we had a menu problem. We had a sourcing problem. The quality difference was so dramatic that customers noticed immediately. Our servers started recommending seafood because they were confident in it.\"\n— Chef [NAME]\n\nTHE LESSON FOR FOOD BUSINESSES:\n\nYour supplier is your partner, not just a vendor. The right partnership transforms your product quality, reduces waste, and increases profitability.\n\n[YOUR_MARKET_NAME] works with [NUMBER] restaurants in [LOCATION]. We're not just selling fish—we're helping businesses succeed.\n\nRestaurateurs: What's your biggest challenge with seafood sourcing?",
        "cta": "If you're a restaurant owner or chef facing similar challenges, let's talk. DM me for a consultation."
      },
      "promotional": {
        "hook": "We're doing something different this month—and it's going to change how local restaurants think about seafood sourcing.",
        "body": "We're doing something different this month—and it's going to change how local restaurants think about seafood sourcing.\n\nFor [NUMBER] years, we've served retail customers and restaurants with the same model: you order, we deliver. But our restaurant partners kept asking for something more strategic.\n\nSo we built it.\n\nINTRODUCING: [PROGRAM_NAME]\n\nA partnership program designed specifically for restaurants who want:\n→ Predictable pricing on core species\n→ First access to seasonal specialties\n→ Custom portioning and prep\n→ Menu development consultation\n→ Staff training on seafood handling\n\nWHAT MAKES THIS DIFFERENT:\n\nMost suppliers sell you fish. We help you build a seafood program.\n\n✓ Dedicated account manager who learns your menu\n✓ Weekly market reports on availability and pricing\n✓ Flexible ordering: standing orders + daily specials\n✓ [DELIVERY_FREQUENCY] delivery windows\n✓ Quality guarantee: [SPECIFIC_GUARANTEE]\n\nWHO THIS IS FOR:\n\n• Restaurants doing $[VOLUME_AMOUNT]+ in weekly seafood\n• Chefs who want to expand seafood offerings\n• Businesses tired of inconsistent quality from broadline distributors\n• Anyone who values partnership over transactional relationships\n\nWHAT IT COSTS:\n\nNothing. This is how we do business now. No membership fees, no minimums beyond our standard [MINIMUM_ORDER].\n\nWHY NOW:\n\nWe're limiting this to [NUMBER] restaurant partners to ensure service quality. [NUMBER] spots are already filled.\n\nIf you're a chef, restaurant owner, or food service operator in [LOCATION] who's serious about seafood quality, let's talk.\n\nComment \"INTERESTED\" or DM me directly. I'll send you the program details and we can schedule a facility tour.\n\nThe future of restaurant seafood is partnership-based. Let's build something together.",
        "cta": "Comment INTERESTED below or DM me to learn more about the program."
      }
    },
    "twitter": {
      "educational": {
        "hook": "Most people are overcooking their fish. Here's the one rule that changes everything:",
        "body": "Most people are overcooking their fish. Here's the one rule that changes everything:\n\nThe 10-minute rule:\nCook fish for 10 minutes per inch of thickness at 400°F.\n\nThat's it.\n\nMeasure the thickest part. Set your timer. Stop second-guessing.\n\nFor a 1-inch fillet:\n• Bake: 10 min\n• Pan sear: 5 min per side\n• Grill: 5 min per side\n\nFlesh should be opaque and flake easily.\n\nPro tip from our fishmongers: [SPECIFIC_TIP]\n\nSave this tweet. Your fish will thank you. 🐟",
        "cta": "What's your go-to cooking method? Reply below! 👇"
      },
      "authority": {
        "hook": "Unpopular opinion: \"Wild-caught\" doesn't automatically mean better quality.\n\nHere's what actually matters: 🧵",
        "body": "Unpopular opinion: \"Wild-caught\" doesn't automatically mean better quality.\n\nHere's what actually matters: 🧵\n\n1/ HANDLING matters more than wild vs. farmed.\n\nBadly handled wild fish < well-managed farmed fish.\n\nHow was it caught? How quickly was it iced? How was it stored?\n\n2/ SPECIES matters.\n\nSome species farm better (salmon, barramundi, trout).\nOthers don't (tuna, swordfish, mahi).\n\nKnow which is which.\n\n3/ LOCATION matters.\n\nNorwegian farmed salmon > sketchy wild-caught from unknown waters.\n\nSourcing transparency beats marketing labels.\n\n4/ FRESHNESS trumps everything.\n\n3-day-old wild fish < today's farmed fish.\n\nAlways.\n\n5/ At [YOUR_MARKET_NAME], we stock both.\n\nWe choose based on [SELECTION_CRITERIA].\n\nQuality first. Labels second.\n\nQuestions? Our team loves talking about this stuff. Stop by or reply here. 🐟",
        "cta": "Wild or farmed—what's your preference? Let's discuss! 💬"
      },
      "case_study": {
        "hook": "Customer came in yesterday: \"I hate fish.\"\n\nLeft with 3 lbs of salmon.\n\nHere's what happened: 🧵",
        "body": "Customer came in yesterday: \"I hate fish.\"\n\nLeft with 3 lbs of salmon.\n\nHere's what happened: 🧵\n\n1/ We asked: \"What fish have you tried?\"\n\n\"Grocery store salmon. Always tastes fishy and weird.\"\n\nAh. There's the problem.\n\n2/ We explained the difference:\n\nGrocery salmon: often frozen, thawed, sitting for days.\nOur salmon: [SOURCING_DETAILS], arrived [TIMEFRAME].\n\n3/ We let them smell it.\n\n\"Wait... it smells like nothing?\"\n\nExactly. Fresh fish doesn't smell fishy.\n\n4/ We gave them our easiest recipe:\n\n[SIMPLE_RECIPE_NAME] - 15 minutes, 4 ingredients.\n\nFoolproof for beginners.\n\n5/ They texted us this morning:\n\n\"I can't believe I've been missing out on this. Coming back Saturday.\"\n\nThis is why we do what we do.\n\nFresh fish converts fish-haters. Every. Single. Time. 🐟\n\n[YOUR_MARKET_NAME]",
        "cta": "Know a fish-hater? Tag them. We'll convert them. 😄"
      },
      "promotional": {
        "hook": "🚨 FLASH SALE 🚨\n\n[FEATURED_FISH]: $[PRICE]/lb\n(Regular $[REGULAR_PRICE])\n\nToday only. While it lasts.",
        "body": "🚨 FLASH SALE 🚨\n\n[FEATURED_FISH]: $[PRICE]/lb\n(Regular $[REGULAR_PRICE])\n\nToday only. While it lasts.\n\nWhy the deal?\n\nWe got an unexpected catch of premium [FEATURED_FISH] this morning. Too much for our regular flow.\n\nYour gain. Our pleasure.\n\n✨ What you're getting:\n• [QUALITY_DESCRIPTOR]\n• Perfect for [COOKING_METHOD]\n• [FLAVOR_PROFILE]\n\n📍 [YOUR_ADDRESS]\n⏰ Until [CLOSING_TIME] or sold out\n\nFirst come, first served.\n\nNo online orders for this one—you gotta show up.\n\nSee you soon! 🐟",
        "cta": "RT to help us move this fish! Your friends will thank you. 🙏"
      }
    }
  },
  "video_scripts": {
    "educational": [
      {
        "title": "How to Tell if Fish is Fresh",
        "duration": "60 seconds",
        "hook": "That fish isn't fresh - here's how to know for sure",
        "body": "Look for three things: clear, bright eyes not cloudy. Firm flesh that springs back when pressed. Fresh ocean smell, never fishy or ammonia-like. At [MARKET_NAME], we get deliveries [FREQUENCY] so you always see these signs. Pro tip: check the gills - they should be bright red, not brown.",
        "cta": "Come smell the difference today. We'll teach you what fresh really means."
      },
      {
        "title": "The Right Way to Store Fresh Fish",
        "duration": "60 seconds",
        "hook": "You're storing your fish wrong and wasting money",
        "body": "Fresh fish should be cooked within 1-2 days max. Keep it in the coldest part of your fridge, around 32°F. Place it on ice in a perforated pan so water drains away. Never let fish sit in melted ice water. Frozen? Keep at 0°F or below and use within 3-6 months depending on the type.",
        "cta": "Ask our fishmongers for a free ice pack with your purchase - we want your fish perfect at home."
      },
      {
        "title": "Sustainable Seafood Explained in 60 Seconds",
        "duration": "60 seconds",
        "hook": "Is your seafood destroying the ocean? Here's how to know",
        "body": "Look for these certifications: MSC for wild-caught, ASC for farm-raised. Avoid overfished species like Atlantic bluefin tuna. Choose abundant options like Pacific sardines or farmed oysters. At [MARKET_NAME], we label everything with sustainability ratings and source from [SPECIFIC_SOURCES].",
        "cta": "Download our seasonal sustainable seafood guide at the counter - free with any purchase."
      }
    ],
    "testimonial": [
      {
        "title": "From Cooking Novice to Seafood Confident",
        "duration": "60 seconds",
        "hook": "I was terrified of cooking fish until I met [FISHMONGER_NAME]",
        "body": "Customer speaks: 'I only bought frozen fish sticks before. But [FISHMONGER_NAME] showed me how easy it is - just salt, pepper, lemon, and 10 minutes in the oven. Now I cook salmon every week. They even text me when my favorite halibut comes in. My family thinks I went to culinary school.' Show customer selecting fish, fishmonger explaining, finished dish at home.",
        "cta": "Meet our fishmongers - they're teachers, not just sellers. First-timer? Tell us and get a free cooking guide."
      },
      {
        "title": "The Restaurant Owner Who Switched",
        "duration": "60 seconds",
        "hook": "This chef ditched his supplier for our fish market",
        "body": "Chef testimonial: 'I ran a seafood restaurant for 8 years using big distributors. Then I walked into [MARKET_NAME] and saw what fresh actually means. Now I'm here at 6am three times a week. My food costs went down 15% and my Yelp reviews mention the fish quality constantly. The flexibility to grab exactly what I need changed my menu completely.'",
        "cta": "Restaurant owners: Ask about our commercial accounts and early-bird access."
      },
      {
        "title": "The Sustainability Convert",
        "duration": "60 seconds",
        "hook": "I thought sustainable seafood was just marketing hype",
        "body": "Customer story: 'I'm a marine biology teacher and I was skeptical. But [MARKET_NAME] showed me their sourcing docs, introduced me to their suppliers, explained their traceability system. Now I bring my students here for field trips. They're the real deal - not greenwashing like the big chains.'",
        "cta": "Ask us anything about where your seafood comes from. If we can't answer it, we'll find out."
      }
    ],
    "promotional": [
      {
        "title": "Weekend Seafood Boil Made Easy",
        "duration": "60 seconds",
        "hook": "Throwing a seafood boil? We just made it stupid simple",
        "body": "Show pre-portioned seafood boil kits: 'Everything you need in one bag. [X]lbs shrimp, [X]lbs mussels, [X] crab clusters, plus our house seasoning blend. Feeds [X] people. Just add corn and potatoes. We prep it Friday and Saturday mornings. Order by Thursday, pick up weekend morning, boiling by afternoon.' Show happy gathering eating.",
        "cta": "This weekend's kits are 20% off. Order at the counter or call [PHONE]. Limited to [X] kits."
      },
      {
        "title": "Taco Tuesday Just Got Better",
        "duration": "60 seconds",
        "hook": "Your Taco Tuesday needs an upgrade - here's how",
        "body": "Every Tuesday we offer fresh mahi-mahi, cod, or shrimp at special pricing - perfect for fish tacos. We'll even give you our secret Baja-style recipe card. Show quick prep: 'Season, pan-sear 3 minutes per side, done. Way better than ground beef, just as easy.' Show finished tacos.",
        "cta": "Taco Tuesday Special every week. In by 6pm Tuesdays, mention this video for free cilantro and limes."
      },
      {
        "title": "The Oyster Happy Hour You Didn't Know About",
        "duration": "60 seconds",
        "hook": "We're selling $3 oysters and nobody knows about it",
        "body": "Every [DAY] from [TIME] to [TIME], fresh oysters are $3 each, shucked while you wait. Show the varieties available: 'East Coast, West Coast, Gulf - we rotate based on what's best. Bring your own wine, we provide the mignonette and hot sauce. It's basically a raw bar without the markup.'",
        "cta": "This [DAY] only. First come, first served. Tell your oyster-loving friends."
      }
    ]
  },
  "ugc_prompts": [
    {
      "prompt": "Show us your best fish market haul! Tag us with what you bought and what you're making tonight.",
      "hashtag": "#FreshCatchChallenge"
    },
    {
      "prompt": "Film your reaction to your first bite of the dish you made with our fish. Bonus points for dramatic faces!",
      "hashtag": "#FirstBiteFeels"
    },
    {
      "prompt": "Ask our fishmongers a question on camera and film their answer. Let's show people how helpful they are!",
      "hashtag": "#AskTheFishmonger"
    },
    {
      "prompt": "Show us your before and after: raw fish from our market vs. your finished masterpiece.",
      "hashtag": "#MarketToPlate"
    },
    {
      "prompt": "Bring your kids to the market and film their reaction to seeing whole fish, live lobsters, or the ice displays.",
      "hashtag": "#FishMarketKids"
    }
  ],
  "viral_triggers": [
    {
      "angle": "Fishmonger filleting a whole tuna in real-time with calming music",
      "why": "Oddly satisfying content performs exceptionally well. The skill demonstration combined with ASMR-style audio taps into multiple viral categories. Tuna breakdowns are inherently dramatic and visual."
    },
    {
      "angle": "Blind taste test: our fresh fish vs. grocery store fish with shocked reactions",
      "why": "Comparison content with genuine reactions drives engagement and shares. Creates controversy in comments (people defending grocery stores) which boosts algorithm performance."
    },
    {
      "angle": "Time-lapse of a full day at the fish market from 5am delivery to closing",
      "why": "Behind-the-scenes content humanizes the business. The 5am start time surprises people and creates respect. Shows the work that goes into freshness."
    },
    {
      "angle": "Fishmonger rates celebrity chef seafood recipes: 'Would this actually work?'",
      "why": "Expert reaction content is highly shareable. Combines authority with entertainment. Gordon Ramsay or Ina Garten content gets searched and shared heavily."
    },
    {
      "angle": "'Things customers say that make fishmongers die inside' comedy series",
      "why": "Relatable workplace humor performs well across industries. Creates community among seafood professionals and educates customers entertainingly. Comment section becomes content goldmine."
    }
  ],
  "social_post_templates": [
    {
      "platform": "Instagram",
      "post_type": "Daily catch announcement",
      "template": "JUST IN 🐟\n\n[FISH_TYPE] - [ORIGIN]\n[PRICE_PER_LB] per lb\n\n[ONE_SENTENCE_DESCRIPTION]\n\nBest prepared: [COOKING_METHOD]\nPairs with: [PAIRING_SUGGESTION]\n\nIn stock now while it lasts!\n\n#FreshFish #[CITY]Seafood #LocalFishMarket"
    },
    {
      "platform": "Facebook",
      "post_type": "Educational tip",
      "template": "🔥 FISHMONGER TIP OF THE DAY 🔥\n\n[QUESTION_CUSTOMERS_ASK]?\n\nHere's what you need to know:\n\n[3_BULLET_POINTS_WITH_ANSWER]\n\nGot seafood questions? Our team has [X] years combined experience. We're here to help!\n\nSee you soon,\n[MARKET_NAME] Team"
    },
    {
      "platform": "Instagram Stories",
      "post_type": "This or That poll",
      "template": "Sticker poll with two fish images:\n\n'TONIGHT'S DINNER'\n\n[FISH_OPTION_1] 🆚 [FISH_OPTION_2]\n\nBoth fresh today!\nBoth [PRICE_RANGE]\n\nVote below 👇\n\n[Follow-up story showing results and quick recipe for winner]"
    },
    {
      "platform": "Facebook",
      "post_type": "Weekend special announcement",
      "template": "WEEKEND SPECIAL 🎉\n\n[DAY] & [DAY] Only:\n[PRODUCT] - [DISCOUNT_AMOUNT] OFF\n\n[WHY_THIS_FISH_IS_SPECIAL_NOW]\n\nPerfect for: [USE_CASE]\nServes: [SERVING_SIZE]\n\nCall ahead to reserve: [PHONE]\nOr stop by [HOURS]\n\n📍 [ADDRESS]"
    },
    {
      "platform": "Instagram",
      "post_type": "Customer feature",
      "template": "CUSTOMER SPOTLIGHT 🌟\n\n[CUSTOMER_NAME] has been shopping with us for [TIME_PERIOD]. [HIS/HER] go-to order? [PRODUCT]\n\n\"[CUSTOMER_QUOTE_ABOUT_WHY_THEY_LOVE_IT]\"\n\nWe love our regulars! Thanks for being part of the [MARKET_NAME] family, [CUSTOMER_NAME]!\n\nWhat's YOUR go-to order? Comment below 👇"
    },
    {
      "platform": "Facebook",
      "post_type": "Seasonal transition",
      "template": "[SEASON] is here and that means [SEASONAL_FISH] season! 🎣\n\nWhat makes [SEASON] special for seafood:\n✅ [REASON_1]\n✅ [REASON_2]\n✅ [REASON_3]\n\nComing soon to our counter:\n• [FISH_1]\n• [FISH_2]\n• [FISH_3]\n\nWho's excited? Drop a 🐟 in the comments!"
    }
  ],
  "seasonal_patterns": [
    {
      "season": "Spring",
      "demand_level": "high",
      "content_themes": [
        "Lenten fish traditions",
        "Spring grilling season kickoff",
        "Fresh seasonal catches"
      ],
      "campaign_focus": "Lenten promotions (Ash Wednesday through Easter), emphasize sustainable catches, introduce lighter preparations for warming weather",
      "budget_allocation_pct": 28,
      "key_dates": [
        "Ash Wednesday (Feb 26-Mar 12)",
        "Good Friday",
        "Earth Day (April 22)",
        "Opening of local fishing seasons"
      ]
    },
    {
      "season": "Summer",
      "demand_level": "peak",
      "content_themes": [
        "BBQ and grilling seafood",
        "Beach party preparations",
        "Peak freshness messaging"
      ],
      "campaign_focus": "Grilling guides, party platters, whole fish displays, premium shellfish for gatherings, extended hours for weekend shoppers",
      "budget_allocation_pct": 32,
      "key_dates": [
        "Memorial Day weekend",
        "July 4th weekend",
        "Labor Day weekend",
        "Peak tourist season (June-August)"
      ]
    },
    {
      "season": "Fall",
      "demand_level": "medium",
      "content_themes": [
        "Hearty seafood stews",
        "Football game day appetizers",
        "Holiday meal planning"
      ],
      "campaign_focus": "Transition to comfort seafood dishes, game day shrimp platters, early Thanksgiving/Christmas planning, oyster season promotion",
      "budget_allocation_pct": 25,
      "key_dates": [
        "NFL season start (September)",
        "Thanksgiving prep week",
        "Oyster season opening (months ending in 'R')"
      ]
    },
    {
      "season": "Winter",
      "demand_level": "high",
      "content_themes": [
        "Holiday entertaining",
        "New Year health resolutions",
        "Omega-3 health benefits"
      ],
      "campaign_focus": "Premium holiday selections, New Year healthy eating campaigns, Valentine's Day romantic dinners, Super Bowl party platters",
      "budget_allocation_pct": 15,
      "key_dates": [
        "Christmas Eve/Day",
        "New Year's Eve",
        "Super Bowl Sunday",
        "Valentine's Day"
      ]
    }
  ],
  "weekly_patterns": {
    "best_posting_days": [
      "Tuesday",
      "Thursday",
      "Friday"
    ],
    "worst_posting_days": [
      "Monday",
      "Sunday"
    ],
    "engagement_by_day": {
      "Monday": "low - customers recovering from weekend, planning week ahead",
      "Tuesday": "high - meal planning day, customers researching dinner options",
      "Wednesday": "medium - mid-week dinner inspiration seekers",
      "Thursday": "peak - weekend meal planning begins, highest engagement for fresh catch posts",
      "Friday": "high - last-minute weekend shoppers, party planner traffic",
      "Saturday": "medium - in-store focus, social media for same-day specials only",
      "Sunday": "low - family day, minimal engagement except for Monday meal prep"
    },
    "content_type_by_day": {
      "Monday": "educational content - cooking techniques, health benefits, storage tips",
      "Tuesday": "recipe inspiration - simple weeknight meals, quick preparations",
      "Wednesday": "behind-the-scenes - sourcing stories, fisherman features, sustainability",
      "Thursday": "fresh catch announcements - daily specials, weekend availability previews",
      "Friday": "urgent/timely - same-day specials, party platter promotions, weekend hours",
      "Saturday": "visual showcasing - beautiful product displays, customer testimonials",
      "Sunday": "meal prep content - batch cooking ideas, week-ahead planning"
    }
  },
  "monthly_patterns": [
    {
      "month": "January",
      "industry_events": [
        "New Year health resolution season",
        "Dry January alternatives",
        "Winter Restaurant Week (many cities)"
      ],
      "content_opportunities": [
        "Healthy eating campaigns emphasizing lean protein",
        "Cooking class promotions",
        "Loyalty program launches"
      ],
      "budget_pct": 6,
      "notes": "Post-holiday slowdown but health-conscious buyers active. Promote omega-3 benefits and lean proteins."
    },
    {
      "month": "February",
      "industry_events": [
        "Ash Wednesday/Lent begins (varies)",
        "Valentine's Day",
        "Super Bowl Sunday"
      ],
      "content_opportunities": [
        "Lenten Friday fish specials",
        "Romantic dinner packages",
        "Game day shrimp and oyster platters"
      ],
      "budget_pct": 12,
      "notes": "Major spike around Valentine's Day and Super Bowl. Lent can begin late February, driving Friday demand."
    },
    {
      "month": "March",
      "industry_events": [
        "Lenten season peak",
        "Spring Break preparations",
        "St. Patrick's Day"
      ],
      "content_opportunities": [
        "Every Friday fish promotions",
        "Spring break party platters",
        "Irish-inspired seafood dishes"
      ],
      "budget_pct": 11,
      "notes": "Strongest Lenten demand. Every Friday is high-traffic. Promote convenience and variety."
    },
    {
      "month": "April",
      "industry_events": [
        "Easter weekend",
        "Earth Day (April 22)",
        "Spring fishing season opens",
        "Passover (varies)"
      ],
      "content_opportunities": [
        "Easter feast centerpieces",
        "Sustainable sourcing campaigns",
        "Fresh local catch introductions"
      ],
      "budget_pct": 10,
      "notes": "Easter drives premium purchases. Post-Lent adjustment but Earth Day sustainability messaging resonates."
    },
    {
      "month": "May",
      "industry_events": [
        "Memorial Day weekend",
        "Grilling season begins",
        "Mother's Day",
        "Graduation season"
      ],
      "content_opportunities": [
        "BBQ seafood guides",
        "Party platter promotions",
        "Gift certificates for Mother's Day"
      ],
      "budget_pct": 9,
      "notes": "Summer season kickoff. Memorial Day weekend is critical for establishing summer customer patterns."
    },
    {
      "month": "June",
      "industry_events": [
        "Father's Day",
        "Summer solstice",
        "Peak tourist season begins",
        "Wedding season peak"
      ],
      "content_opportunities": [
        "Grilling masterclasses for dads",
        "Catering for events",
        "Tourist-friendly prepared options"
      ],
      "budget_pct": 8,
      "notes": "High volume month. Focus on convenience for tourists and event catering opportunities."
    },
    {
      "month": "July",
      "industry_events": [
        "Independence Day",
        "Peak summer vacation season",
        "Local seafood festivals"
      ],
      "content_opportunities": [
        "July 4th party packages",
        "Vacation-friendly prepared meals",
        "Festival partnerships"
      ],
      "budget_pct": 10,
      "notes": "Highest traffic month. July 4th weekend can represent 15-20% of monthly revenue."
    },
    {
      "month": "August",
      "industry_events": [
        "Back-to-school season",
        "Late summer vacations",
        "Peak shellfish season"
      ],
      "content_opportunities": [
        "Quick family dinner solutions",
        "Labor Day weekend promotions",
        "Premium shellfish showcases"
      ],
      "budget_pct": 9,
      "notes": "Transition month. Maintain summer volume while introducing fall convenience messaging."
    },
    {
      "month": "September",
      "industry_events": [
        "Labor Day weekend",
        "NFL season kickoff",
        "Oyster season begins",
        "Rosh Hashanah (varies)"
      ],
      "content_opportunities": [
        "Game day appetizer bundles",
        "Oyster happy hours",
        "Jewish holiday traditional fish dishes"
      ],
      "budget_pct": 7,
      "notes": "Post-Labor Day slowdown but football season creates weekly traffic spikes on Thursdays-Sundays."
    },
    {
      "month": "October",
      "industry_events": [
        "National Seafood Month",
        "Halloween",
        "Breast Cancer Awareness (pink salmon tie-ins)"
      ],
      "content_opportunities": [
        "Educational campaigns",
        "Themed Halloween appetizers",
        "Cause marketing with salmon"
      ],
      "budget_pct": 6,
      "notes": "Slower month overall. Leverage National Seafood Month for educational content and loyalty building."
    },
    {
      "month": "November",
      "industry_events": [
        "Thanksgiving",
        "Black Friday/Small Business Saturday",
        "Giving Tuesday"
      ],
      "content_opportunities": [
        "Thanksgiving alternatives to turkey",
        "Holiday gift certificates",
        "Community giveback programs"
      ],
      "budget_pct": 7,
      "notes": "Thanksgiving week is critical. Many customers seek seafood alternatives. Strong gift certificate sales period."
    },
    {
      "month": "December",
      "industry_events": [
        "Christmas Eve/Day",
        "New Year's Eve",
        "Hanukkah (varies)",
        "Feast of Seven Fishes (Dec 24)"
      ],
      "content_opportunities": [
        "Premium holiday selections",
        "Italian Christmas Eve traditions",
        "New Year's Eve party packages"
      ],
      "budget_pct": 15,
      "notes": "Highest revenue month. Christmas Eve can be single biggest day of year. Pre-ordering systems essential."
    }
  ],
  "peak_crisis_times": {
    "last_minute_dinner_panic": {
      "when": "4pm-6pm weekdays",
      "customer_need": "Quick, easy dinner solution with no planning",
      "solution": "Pre-marinated options, 15-minute meal kits, recipe cards at checkout, text-ahead ordering"
    },
    "unexpected_guests": {
      "when": "Friday-Sunday afternoons",
      "customer_need": "Impressive food fast, feeds a crowd",
      "solution": "Party platters, peel-and-eat shrimp, oysters by the dozen, seafood boil kits ready to go"
    },
    "holiday_hosting_stress": {
      "when": "Week before major holidays",
      "customer_need": "Impressive centerpiece, reliable quality, guidance on quantity",
      "solution": "Pre-order systems, cooking hotline, size calculators, guaranteed availability, free cooking guides"
    },
    "diet_restart_monday": {
      "when": "Monday mornings, January, post-vacation",
      "customer_need": "Healthy protein, meal prep guidance, portion control",
      "solution": "Pre-portioned fillets, meal prep packages, nutrition info prominently displayed, healthy recipe cards"
    },
    "forgot_anniversary": {
      "when": "Random, usually discovered morning-of",
      "customer_need": "Romantic dinner ingredients that look thoughtful and special",
      "solution": "Date night packages, champagne pairings, recipe cards for romantic meals, gift packaging available"
    }
  },
  "pricing_psychology": {
    "premium_positioning": {
      "strategy": "Price 15-25% above grocery stores but emphasize freshness gap",
      "messaging": "'Caught yesterday, not last week' - justify premium with recency and quality",
      "display": "Show delivery dates prominently, use 'day boat' and 'line-caught' descriptors"
    },
    "charm_pricing": {
      "strategy": "Use .99 or .95 endings for everyday items, round numbers for premium",
      "example": "$12.99/lb for everyday salmon, $24/lb for king salmon (round number = luxury)",
      "reasoning": "Charm pricing for value perception, round for premium perception"
    },
    "anchoring": {
      "strategy": "Display premium items first to make mid-tier seem reasonable",
      "example": "Show $45/lb wild king salmon first, then $18/lb sockeye seems like a deal",
      "application": "Counter layout, menu boards, online listings - expensive first"
    },
    "bundle_pricing": {
      "strategy": "Bundles priced to save 10-15% vs. individual items",
      "example": "Seafood boil kit $59.99 (worth $72 separately) - show the savings",
      "psychology": "Higher total sale, perceived value, reduces decision fatigue"
    },
    "scarcity_premium": {
      "strategy": "Limited items can command 20-30% premium when scarcity is genuine",
      "messaging": "'Only 6 portions available' or 'First catch of the season'",
      "application": "Seasonal specialties, day-boat catches, unusual species"
    },
    "per_person_pricing": {
      "strategy": "Offer 'per person' pricing for parties alongside per-pound",
      "example": "'Feeds 4 people - $48' is easier to process than '2.5 lbs at $19.20/lb'",
      "benefit": "Reduces mental math, increases average transaction, clearer value"
    }
  },
  "service_packages": {
    "basic_tier": {
      "name": "Fresh Catch Basic",
      "description": "Perfect for the home cook who wants quality fish without extras",
      "includes": [
        "Fresh fish selection",
        "Basic prep (scaled, gutted)",
        "Ice pack for transport",
        "Storage tips card"
      ],
      "price_position": "Standard per-pound pricing",
      "target_customer": "Regular weeknight cooks, budget-conscious families"
    },
    "premium_tier": {
      "name": "Chef's Selection",
      "description": "For customers who want restaurant-quality with convenience",
      "includes": [
        "Premium fish selection",
        "Custom cutting/portioning",
        "Marinating service available",
        "Recipe card included",
        "Cooking tips from fishmonger",
        "Premium ice pack"
      ],
      "price_position": "Add $3-5 per order for service",
      "target_customer": "Busy professionals, special occasion cooks, cooking enthusiasts"
    },
    "subscription_tier": {
      "name": "Weekly Catch Club",
      "description": "Subscription for regular seafood lovers",
      "includes": [
        "Weekly curated selection",
        "10% off all purchases",
        "First access to rare catches",
        "Free cooking class quarterly",
        "Text alerts for favorites",
        "Priority pre-ordering"
      ],
      "price_position": "$29/month membership or $299/year",
      "target_customer": "Serious home cooks, health-conscious regulars, seafood enthusiasts"
    },
    "commercial_tier": {
      "name": "Restaurant Partner Program",
      "description": "For restaurants and catering businesses",
      "includes": [
        "Early morning pickup (6-7am)",
        "Volume discounting",
        "Custom cutting specs",
        "Dedicated account manager",
        "Invoice terms available",
        "Quality guarantee"
      ],
      "price_position": "Volume-based pricing, 15-25% below retail",
      "target_customer": "Restaurants, caterers, meal prep businesses"
    },
    "event_tier": {
      "name": "Party Platter Service",
      "description": "Full-service for events and gatherings",
      "includes": [
        "Custom platters designed",
        "Oyster shucking service available",
        "Delivery available",
        "Serving suggestions",
        "Garnishes and accompaniments",
        "Equipment rental (ice displays, etc.)"
      ],
      "price_position": "Minimum $150 order, delivery fee applies",
      "target_customer": "Party hosts, corporate events, special occasions"
    }
  },
  "upsell_paths": {
    "buying_fish_fillet": {
      "immediate_upsell": "Would you like our house seasoning blend? It's $4 and perfect for this fish",
      "complementary_add": "Fresh lemon, garlic, or herbs from our produce section",
      "premium_upgrade": "This is great, but the wild-caught version just came in - $6 more per pound",
      "service_upsell": "Want me to portion this into individual servings for you?",
      "future_upsell": "Join our text list - we'll alert you when this comes back in stock"
    },
    "buying_shrimp": {
      "immediate_upsell": "Cocktail sauce or our house remoulade? Both homemade",
      "complementary_add": "Andouille sausage for a low-country boil? We have it up front",
      "premium_upgrade": "These are good, but the jumbo Gulf shrimp are incredible - $8 more per pound",
      "quantity_upsell": "Get 2 pounds instead of 1 and save $3 per pound",
      "future_upsell": "We do a shrimp boil kit on weekends - want me to save you one?"
    },
    "buying_salmon": {
      "immediate_upsell": "Cedar plank for grilling? We have them soaking and ready - $6",
      "complementary_add": "Our maple-bourbon glaze is perfect for salmon - $7",
      "premium_upgrade": "This Atlantic is great, but the wild king salmon is once-a-year quality",
      "service_upsell": "I can remove the pin bones for you - takes 2 minutes",
      "future_upsell": "Want to join our Salmon Club? We text you when wild salmon comes in"
    },
    "buying_oysters": {
      "immediate_upsell": "Mignonette sauce or hot sauce? We make both in-house",
      "complementary_add": "Oyster knife? This one has a safety guard - $12",
      "quantity_upsell": "Oysters are $2 each, but get a dozen for $20",
      "premium_upgrade": "Try mixing in some Kumamotos - they're sweeter, $3 each",
      "future_upsell": "We do oyster happy hour Thursdays - want me to text you?"
    },
    "first_time_customer": {
      "immediate_upsell": "Since it's your first time, grab a recipe card - they're free",
      "complementary_add": "You'll need a good fish spatula - these are $15 and last forever",
      "service_upsell": "Want a quick lesson on how to tell if fish is fresh? Takes 30 seconds",
      "loyalty_upsell": "Join our text club - you'll get 10% off your next visit",
      "future_upsell": "We do cooking classes once a month - want me to add you to the list?"
    }
  },
  "retention_hooks": {
    "text_alert_system": {
      "hook": "Get texts when your favorites arrive",
      "mechanism": "Customers opt-in to alerts for specific fish types",
      "retention_power": "Creates anticipation and FOMO, drives repeat visits",
      "implementation": "Simple signup at checkout, personalized by preference"
    },
    "punch_card_program": {
      "hook": "Buy 9 pounds, get your 10th pound free",
      "mechanism": "Physical or digital punch card tracked by phone number",
      "retention_power": "Incentivizes choosing you over competitors to complete card",
      "implementation": "Any fish counts, encourages trying new varieties"
    },
    "recipe_continuity": {
      "hook": "Multi-week recipe series that builds skills",
      "mechanism": "Week 1: Pan-searing basics, Week 2: Grilling, Week 3: Poaching, etc.",
      "retention_power": "Creates commitment to return and complete the learning journey",
      "implementation": "Handed out with purchases, promoted on social media"
    },
    "seasonal_challenges": {
      "hook": "Try 5 different fish this season, win a prize",
      "mechanism": "Tracking card stamped for each new variety tried",
      "retention_power": "Gamification drives multiple visits and exploration",
      "implementation": "Prize: $25 gift card, cooking class, or premium item"
    },
    "vip_early_access": {
      "hook": "Regulars get first pick of rare catches",
      "mechanism": "Text club members get 2-hour advance notice before social media",
      "retention_power": "Status and exclusivity keep engaged customers coming back",
      "implementation": "Reserved items held until noon for VIP list"
    },
    "birthday_club": {
      "hook": "Free pound of your favorite fish on your birthday",
      "mechanism": "Collect birthdays at checkout, automated reminder sent",
      "retention_power": "Creates annual touchpoint and goodwill",
      "implementation": "Up to $20 value, valid birthday week"
    },
    "cooking_class_series": {
      "hook": "Monthly hands-on classes create community",
      "mechanism": "Paid classes ($40-60) with take-home fish and skills",
      "retention_power": "Builds relationships, creates invested customers, generates word-of-mouth",
      "implementation": "Limited to 12 people, themes rotate monthly"
    },
    "fishmonger_relationship": {
      "hook": "Your personal fishmonger remembers your preferences",
      "mechanism": "Staff training to remember regulars and their favorites",
      "retention_power": "Relationship-based loyalty is strongest retention driver",
      "implementation": "CRM notes, staff incentives for customer recognition"
    }
  },
  "referral_strategies": {
    "give_get_program": {
      "structure": "Give $10, Get $10 - both parties benefit",
      "mechanism": "Referrer gets $10 credit when friend makes first $30 purchase",
      "messaging": "Share the fresh fish love - you both save",
      "tracking": "Unique referral cards with codes, tracked at checkout"
    },
    "party_platter_referral": {
      "structure": "Host a party with our platters, get credits for guests who visit",
      "mechanism": "$5 credit for every party guest who mentions the event",
      "messaging": "Your party becomes our best marketing",
      "tracking": "Special code given to hosts, guests mention at first visit"
    },
    "social_share_incentive": {
      "structure": "Post your dish and tag us, get entered to win monthly $50 credit",
      "mechanism": "Monthly drawing from all tagged posts",
      "messaging": "Show off your cooking, win free fish",
      "tracking": "Monitor social tags, announce winner first of month"
    },
    "restaurant_referral": {
      "structure": "Refer a restaurant, get 10% of their first order as credit",
      "mechanism": "When restaurants sign up, ask who referred them",
      "messaging": "Know a chef who needs better fish? Introduce us",
      "tracking": "Sales team tracks referral source, credits applied quarterly"
    },
    "neighborhood_ambassador": {
      "structure": "Become a neighborhood ambassador with special perks",
      "mechanism": "Top referrers get special status, early access, exclusive items",
      "messaging": "Our biggest fans become our partners",
      "tracking": "Formalized program for customers who refer 5+ new customers"
    },
    "cooking_class_referral": {
      "structure": "Bring a friend to cooking class, both get 15% off",
      "mechanism": "Discount applied at registration for pairs",
      "messaging": "Learn together, save together",
      "tracking": "Registration system tracks pairs, applies discount automatically"
    },
    "corporate_referral": {
      "structure": "Refer your company for corporate accounts, get quarterly credits",
      "mechanism": "Companies doing $500+/month, referrer gets $25/quarter",
      "messaging": "Get your office hooked on fresh fish",
      "tracking": "Account manager tracks corporate referrals, quarterly payouts"
    }
  },
  "freshness_metadata": {
    "generated_at": "2025-11-28T04:31:47.469Z",
    "version": "2.0-multipass",
    "source": "multipass-generator"
  },
  "expansion_opportunities": [
    {
      "opportunity": "Prepared Meal Kits with Recipe Cards",
      "description": "Package fresh fish with pre-measured ingredients and chef-created recipe cards. Targets time-strapped customers who want home-cooked meals without planning. Include QR codes linking to video tutorials.",
      "investment_level": "medium",
      "timeline": "short term",
      "expected_roi": "25-35% margin increase per transaction, 40% customer retention boost"
    },
    {
      "opportunity": "Subscription Seafood Box Program",
      "description": "Weekly or bi-weekly curated seafood boxes featuring seasonal catches with variety rotation. Guarantees recurring revenue and reduces daily foot traffic dependency. Offer pickup and delivery options.",
      "investment_level": "medium",
      "timeline": "medium term",
      "expected_roi": "Predictable $15K-$30K monthly recurring revenue for 100-200 subscribers"
    },
    {
      "opportunity": "Lenten Friday Flash Sales via SMS",
      "description": "Build SMS subscriber list and deploy targeted Friday specials during Lent (7 weeks). Creates urgency and drives traffic on highest-demand day. Capture customer data for year-round marketing.",
      "investment_level": "low",
      "timeline": "short term",
      "expected_roi": "300-500% ROI during Lenten season, 20-30% Friday traffic increase"
    },
    {
      "opportunity": "Corporate Lunch Delivery Program",
      "description": "Target nearby office buildings with healthy seafood lunch options. Establish regular delivery routes Tuesday-Friday. Minimum order requirements ensure profitability while building B2B relationships.",
      "investment_level": "medium",
      "timeline": "medium term",
      "expected_roi": "$5K-$10K additional monthly revenue per 10 corporate accounts"
    },
    {
      "opportunity": "Cooking Class and Event Space",
      "description": "Host monthly seafood cooking classes, private parties, and corporate team-building events. Monetize expertise while creating product sales opportunities. Classes typically sell out at $75-$125 per person.",
      "investment_level": "high",
      "timeline": "long term",
      "expected_ROI": "$3K-$8K per event, drives $500-$1500 in product sales per class"
    },
    {
      "opportunity": "Oyster Bar/Raw Bar Addition",
      "description": "Add small raw bar section for immediate consumption with beverage pairings. Captures impulse purchases and creates destination dining experience. Particularly effective in urban locations.",
      "investment_level": "high",
      "timeline": "long term",
      "expected_ROI": "60-70% margins on raw bar items, $2K-$5K weekly incremental revenue"
    },
    {
      "opportunity": "Seasonal Smoked Fish Production",
      "description": "Invest in smoking equipment to create house-smoked salmon, trout, and whitefish. High-margin value-added products with extended shelf life. Strong gift and holiday sales potential.",
      "investment_level": "medium",
      "timeline": "medium term",
      "expected_ROI": "200-300% markup on smoked products, particularly strong November-December"
    },
    {
      "opportunity": "Partnership with Local Restaurants for Supply",
      "description": "Become preferred supplier for 5-10 local restaurants. Guarantees volume sales and stabilizes revenue. Negotiate exclusive menu features that drive consumer traffic to retail location.",
      "investment_level": "low",
      "timeline": "short term",
      "expected_ROI": "$10K-$25K monthly wholesale revenue, 15% consumer crossover traffic"
    }
  ],
  "cross_sell_opportunity_map": {
    "Fresh Whole Fish": {
      "upsells": [
        "Scaling and cleaning service",
        "Marinades and seasonings",
        "Grilling planks and accessories",
        "Side dish ingredients"
      ],
      "timing": "At point of selection, before checkout",
      "pitch_angle": "We can have this cleaned and ready to cook in 5 minutes, and here's our house marinade that pairs perfectly"
    },
    "Salmon Fillets": {
      "upsells": [
        "Cedar grilling planks",
        "Lemon-dill seasoning blend",
        "Asparagus or green beans",
        "Recipe cards for different preparations"
      ],
      "timing": "During weighing/wrapping process",
      "pitch_angle": "Most customers love this with our cedar plank - it's restaurant-quality at home"
    },
    "Shrimp": {
      "upsells": [
        "Cocktail sauce",
        "Garlic butter",
        "Skewers for grilling",
        "Larger quantity discount",
        "Complementary shellfish"
      ],
      "timing": "When customer requests specific quantity",
      "pitch_angle": "If you're having people over, the 3-pound option saves $4 per pound, and we have fresh scallops that pair beautifully"
    },
    "Shellfish (Oysters, Clams, Mussels)": {
      "upsells": [
        "Shucking knives and tools",
        "Mignonette sauce",
        "Crusty bread",
        "White wine recommendations",
        "Shellfish steamers"
      ],
      "timing": "After selection, during conversation about preparation",
      "pitch_angle": "Are you set up with a good shucker? This one is professional-grade and we include a how-to guide"
    },
    "Tuna Steaks": {
      "upsells": [
        "Soy-ginger glaze",
        "Sesame seeds",
        "Sushi-grade designation upsell",
        "Wasabi and pickled ginger"
      ],
      "timing": "When discussing cooking preferences",
      "pitch_angle": "This is actually sushi-grade if you want to do a seared rare - here's our house poke seasoning"
    },
    "Fish Tacos/Casual Meal Fish": {
      "upsells": [
        "Taco seasoning blend",
        "Slaw ingredients",
        "Tortillas",
        "Lime wedges",
        "Multiple fish variety"
      ],
      "timing": "During selection of fish type",
      "pitch_angle": "Mix mahi-mahi and shrimp for variety - we have a taco kit that includes everything except tortillas"
    },
    "Lobster": {
      "upsells": [
        "Drawn butter",
        "Lobster crackers and picks",
        "Corn on the cob",
        "Steamers (clams)",
        "Additional lobster tails"
      ],
      "timing": "At point of lobster tank selection",
      "pitch_angle": "Planning a full New England experience? Add steamers and corn - we'll give you cooking time guides for everything"
    },
    "Smoked Fish": {
      "upsells": [
        "Bagels and cream cheese",
        "Capers and red onion",
        "Additional smoked varieties",
        "Cheese pairings"
      ],
      "timing": "During slicing/packaging",
      "pitch_angle": "Hosting brunch? This smoked salmon trio with our everything bagels is our most popular platter"
    }
  },
  "tiktok_content_templates": [
    {
      "template_name": "Fish Market Morning Rush",
      "format": "day in the life",
      "hook_first_3_seconds": "POV: You arrive at 4AM to the fish market",
      "structure": [
        "Show arrival in darkness with coffee",
        "Unloading fresh catch from ice trucks",
        "Prepping displays with dramatic reveal",
        "First customers arriving at opening"
      ],
      "duration_seconds": 45,
      "cta": "Comment which fish you want to see next",
      "trending_sounds_to_use": [
        "morning motivation audio",
        "satisfying sounds"
      ],
      "hashtag_strategy": [
        "#fishmarket",
        "#dayinthelife",
        "#smallbusiness",
        "#seafood"
      ],
      "why_it_works": "Behind-the-scenes content creates authenticity and shows the work that goes into fresh seafood"
    },
    {
      "template_name": "Fishmonger Reacts",
      "format": "talking head",
      "hook_first_3_seconds": "As a fishmonger, this makes me SO mad",
      "structure": [
        "State the controversial fish opinion",
        "Explain why it's wrong with receipts",
        "Show the right way to do it",
        "Challenge viewers to share their thoughts"
      ],
      "duration_seconds": 30,
      "cta": "Duet this if you disagree",
      "trending_sounds_to_use": [
        "dramatic reveal sound",
        "argument audio"
      ],
      "hashtag_strategy": [
        "#fishmonger",
        "#seafoodtiktok",
        "#foodfacts",
        "#controversy"
      ],
      "why_it_works": "Controversy drives engagement and positions you as the expert authority"
    },
    {
      "template_name": "Fresh vs Frozen Showdown",
      "format": "before-after",
      "hook_first_3_seconds": "I compared $8 frozen salmon to our $22 fresh",
      "structure": [
        "Show both fish side by side",
        "Cook them the exact same way",
        "Taste test with honest reaction",
        "Reveal when frozen is actually better"
      ],
      "duration_seconds": 60,
      "cta": "Save this for your next grocery trip",
      "trending_sounds_to_use": [
        "comparison audio",
        "suspenseful music"
      ],
      "hashtag_strategy": [
        "#seafood",
        "#cookinghacks",
        "#fishmarket",
        "#foodcomparison"
      ],
      "why_it_works": "Educational content that challenges assumptions keeps viewers watching to the end"
    },
    {
      "template_name": "Cutting Whole Fish Tutorial",
      "format": "tutorial",
      "hook_first_3_seconds": "You're wasting $30 buying pre-cut fish",
      "structure": [
        "Show whole fish vs fillets price difference",
        "Quick tutorial on basic filleting",
        "Show all the extra meat you get",
        "Calculate total savings"
      ],
      "duration_seconds": 50,
      "cta": "Drop a 🐟 if you'll try this",
      "trending_sounds_to_use": [
        "satisfying cutting sounds",
        "money saving audio"
      ],
      "hashtag_strategy": [
        "#cookingtutorial",
        "#moneysavingtips",
        "#fishmarket",
        "#foodhacks"
      ],
      "why_it_works": "Money-saving content performs well and positions market as educational resource"
    },
    {
      "template_name": "Guess the Price Game",
      "format": "duet bait",
      "hook_first_3_seconds": "Guess how much this lobster costs",
      "structure": [
        "Show the seafood item up close",
        "Pan to other expensive looking items",
        "Build suspense with reactions",
        "Reveal actual price with shock factor"
      ],
      "duration_seconds": 25,
      "cta": "Comment your guess before the reveal",
      "trending_sounds_to_use": [
        "game show music",
        "suspense build"
      ],
      "hashtag_strategy": [
        "#guessthecost",
        "#fishmarket",
        "#seafood",
        "#pricereveals"
      ],
      "why_it_works": "Interactive content drives comments and shares for algorithm boost"
    },
    {
      "template_name": "Seasonal Fish Calendar",
      "format": "b-roll montage",
      "hook_first_3_seconds": "The fish you're buying is NOT in season",
      "structure": [
        "Show calendar graphic overlay",
        "Display fish available this month",
        "Explain why seasonal matters",
        "Show taste/price difference proof"
      ],
      "duration_seconds": 40,
      "cta": "Save this seasonal guide",
      "trending_sounds_to_use": [
        "educational voiceover trend",
        "nature sounds"
      ],
      "hashtag_strategy": [
        "#seasonaleating",
        "#fishmarket",
        "#sustainable",
        "#foodeducation"
      ],
      "why_it_works": "Evergreen educational content gets saved and shared repeatedly"
    },
    {
      "template_name": "Customer Confusion Stories",
      "format": "POV",
      "hook_first_3_seconds": "POV: Customer asks if the fish is fresh",
      "structure": [
        "Act out customer's ridiculous question",
        "Show your internal reaction",
        "Professional response you give",
        "Cut to what you really wanted to say"
      ],
      "duration_seconds": 20,
      "cta": "Retail workers know the pain",
      "trending_sounds_to_use": [
        "relatable audio",
        "comedy timing sounds"
      ],
      "hashtag_strategy": [
        "#retailworker",
        "#fishmarket",
        "#customerservice",
        "#relatable"
      ],
      "why_it_works": "Relatable retail humor creates community and drives shares from service workers"
    },
    {
      "template_name": "Fishmonger Smell Test",
      "format": "talking head",
      "hook_first_3_seconds": "If your fish smells fishy, return it immediately",
      "structure": [
        "Explain the smell test rule",
        "Demonstrate on fresh vs old fish",
        "Show other freshness indicators",
        "Reveal what to ask your fishmonger"
      ],
      "duration_seconds": 35,
      "cta": "Share this with someone who needs to know",
      "trending_sounds_to_use": [
        "mind blown audio",
        "educational trend"
      ],
      "hashtag_strategy": [
        "#fishmarket",
        "#cookingtips",
        "#foodsafety",
        "#lifehacks"
      ],
      "why_it_works": "Practical tips that solve real problems get saved and shared widely"
    },
    {
      "template_name": "Exotic Fish Unboxing",
      "format": "b-roll montage",
      "hook_first_3_seconds": "This fish costs $400 and you've never seen it",
      "structure": [
        "Dramatic unboxing of rare shipment",
        "Close-up of unique features",
        "Explain origin and rarity",
        "Show preparation or cutting process"
      ],
      "duration_seconds": 55,
      "cta": "Would you try this? Yes or no",
      "trending_sounds_to_use": [
        "luxury unboxing audio",
        "exotic music"
      ],
      "hashtag_strategy": [
        "#fishmarket",
        "#exoticfood",
        "#seafood",
        "#unboxing"
      ],
      "why_it_works": "Novelty and luxury content drives curiosity and watch time"
    },
    {
      "template_name": "Three Fish Three Ways",
      "format": "tutorial",
      "hook_first_3_seconds": "Same fish, three completely different meals",
      "structure": [
        "Show one whole fish",
        "Quick cuts of three cooking methods",
        "30-second prep for each",
        "Final plating of all three"
      ],
      "duration_seconds": 60,
      "cta": "Which one are you making tonight?",
      "trending_sounds_to_use": [
        "cooking montage audio",
        "fast-paced beat"
      ],
      "hashtag_strategy": [
        "#cookingtiktok",
        "#fishrecipes",
        "#mealprep",
        "#fishmarket"
      ],
      "why_it_works": "Recipe content with variety appeals to different viewer preferences and gets saved"
    }
  ],
  "tiktok_hooks": [
    {
      "hook": "Stop buying salmon at the grocery store",
      "category": "controversy",
      "follow_up_content": "Explain quality differences and price comparison between grocery vs fish market"
    },
    {
      "hook": "This $8 fish tastes better than lobster",
      "category": "curiosity",
      "follow_up_content": "Reveal underrated fish species and demonstrate cooking method"
    },
    {
      "hook": "I've been a fishmonger for 10 years and THIS shocked me",
      "category": "insider",
      "follow_up_content": "Share surprising industry secret or unusual customer request"
    },
    {
      "hook": "POV: You ask for the freshest fish",
      "category": "relatable",
      "follow_up_content": "Act out the interaction showing how fishmongers actually determine freshness"
    },
    {
      "hook": "You're being scammed at the seafood counter",
      "category": "FOMO",
      "follow_up_content": "Expose common pricing tricks or mislabeling practices to watch for"
    },
    {
      "hook": "This is what $100 gets you at a real fish market",
      "category": "curiosity",
      "follow_up_content": "Show haul of various seafood and compare to grocery store equivalent"
    },
    {
      "hook": "As a fishmonger, please stop doing this",
      "category": "controversy",
      "follow_up_content": "Call out common customer mistakes when buying or storing fish"
    },
    {
      "hook": "I compared fresh tuna to canned and I'm shook",
      "category": "transformation",
      "follow_up_content": "Side-by-side taste test with honest reactions and price breakdown"
    },
    {
      "hook": "The fish market at 5AM hits different",
      "category": "insider",
      "follow_up_content": "Show early morning auction, delivery trucks, and prep work"
    },
    {
      "hook": "Red flags when buying fish that everyone ignores",
      "category": "FOMO",
      "follow_up_content": "List visual and smell indicators of old fish with demonstrations"
    },
    {
      "hook": "This is illegal but every fish market does it",
      "category": "controversy",
      "follow_up_content": "Reveal harmless industry practice that sounds worse than it is (like ice display methods)"
    },
    {
      "hook": "POV: Customer asks if the fish is wild caught",
      "category": "relatable",
      "follow_up_content": "Humorous take on explaining farmed vs wild to confused customers"
    },
    {
      "hook": "I filleted a 50 pound tuna in under 3 minutes",
      "category": "transformation",
      "follow_up_content": "Time-lapse of expert filleting with satisfying knife work"
    },
    {
      "hook": "The most expensive fish I've ever sold cost",
      "category": "curiosity",
      "follow_up_content": "Reveal price and species, explain what makes it valuable"
    },
    {
      "hook": "Grocery store sushi vs fish market sushi",
      "category": "transformation",
      "follow_up_content": "Make both versions, compare quality and taste side by side"
    },
    {
      "hook": "Things you can ask your fishmonger for free",
      "category": "FOMO",
      "follow_up_content": "List free services like scaling, gutting, recipe advice, bones for stock"
    },
    {
      "hook": "This customer tried to return fish after 3 days",
      "category": "relatable",
      "follow_up_content": "Tell story of ridiculous customer service situation with humor"
    },
    {
      "hook": "I'm exposing the fish industry's biggest secret",
      "category": "insider",
      "follow_up_content": "Reveal that 'fresh' legally means never frozen, explain flash freezing benefits"
    },
    {
      "hook": "When someone asks what the catch of the day is",
      "category": "trend-jack",
      "follow_up_content": "Use trending audio to show daily fresh arrivals in comedic way"
    },
    {
      "hook": "You're pronouncing these fish names wrong",
      "category": "controversy",
      "follow_up_content": "Correct pronunciation guide for commonly mispronounced seafood"
    }
  ],
  "tiktok_trends_to_leverage": [
    {
      "trend_type": "Hear Me Out Cake",
      "how_to_adapt": "Put photos of underrated fish species on cake toppers, defend why each is actually amazing",
      "example_caption": "Hear me out... these fish are better than salmon 🐟 #hearmeout #fishmarket #seafood #unpopularopinion",
      "best_time_to_post": "Wednesday 7-9 PM"
    },
    {
      "trend_type": "Get Ready With Me",
      "how_to_adapt": "Show getting ready for work at 4AM, putting on gear, setting up the fish counter",
      "example_caption": "GRWM for a 4AM shift at the fish market 🐠 #grwm #fishmarket #dayinthelife #smallbusiness",
      "best_time_to_post": "Monday 6-8 AM"
    },
    {
      "trend_type": "Things I Learned Working At",
      "how_to_adapt": "Share surprising facts learned while working at fish market, industry secrets",
      "example_caption": "Things I learned working at a fish market that I'll never forget 🎣 #fishmarket #retailworker #behindthescenes #seafood",
      "best_time_to_post": "Friday 5-7 PM"
    },
    {
      "trend_type": "Romanticize Your Life",
      "how_to_adapt": "Make fish market work look aesthetic - ice displays, fresh catches, morning light through windows",
      "example_caption": "Romanticizing my life as a fishmonger 🌊✨ #romanticizeyourlife #fishmarket #aesthetics #smallbusiness",
      "best_time_to_post": "Sunday 10 AM-12 PM"
    },
    {
      "trend_type": "Corporate vs Small Business",
      "how_to_adapt": "Compare big grocery store seafood counter to local fish market experience",
      "example_caption": "Corporate seafood counter vs your local fish market 🐟 #smallbusiness #fishmarket #supportlocal #seafood",
      "best_time_to_post": "Tuesday 12-2 PM"
    },
    {
      "trend_type": "If You're Seeing This It's Too Late",
      "how_to_adapt": "Show sold-out popular items, create urgency around limited fresh catches",
      "example_caption": "If you're seeing this it's too late... the king salmon is GONE 😭 #fishmarket #soldout #seafood #fomo",
      "best_time_to_post": "Saturday 9-11 AM"
    },
    {
      "trend_type": "Gatekeep Gaslight Girlboss",
      "how_to_adapt": "Joke about gatekeeping fish market secrets, gaslighting about freshness, girlbossing the counter",
      "example_caption": "Gatekeep the best fishing spots, gaslight about yesterday's catch, girlboss the fish counter 💅🐟 #fishmarket #girlboss #retailhumor",
      "best_time_to_post": "Thursday 3-5 PM"
    },
    {
      "trend_type": "Suspect Challenge",
      "how_to_adapt": "Describe different types of fish market customers as 'suspects' in humorous way",
      "example_caption": "Suspect asked if we have any fish without bones 💀 #fishmarket #suspect #retailworker #customerservice",
      "best_time_to_post": "Wednesday 6-8 PM"
    }
  ],
  "tiktok_engagement_tactics": {
    "comment_strategies": [
      "Ask viewers to comment their favorite fish for a chance to see it featured next video",
      "Create comment bait by asking controversial questions like 'Is sushi-grade fish a scam?'",
      "Reply to every comment in first hour with personalized fish recommendations",
      "Use comment section to give free cooking tips and build expert authority",
      "Start comment threads asking people to share their worst fish-buying experiences"
    ],
    "duet_opportunities": [
      "Duet cooking videos to show where to source the best fish for their recipe",
      "React to viral seafood cooking fails and offer corrections",
      "Duet grocery store haul videos and compare prices to fish market",
      "Partner with chefs showing them selecting fish at your market",
      "Duet 'what I eat in a day' videos and recommend better fish choices"
    ],
    "stitch_content_ideas": [
      "Stitch food myth videos to debunk seafood misconceptions",
      "Stitch budget cooking content to show affordable fish options",
      "Stitch sustainability content to explain responsible sourcing",
      "Stitch cooking disaster videos to diagnose what went wrong with their fish",
      "Stitch grocery shopping tips to add fish market insider knowledge"
    ],
    "creator_collab_ideas": [
      "Partner with local chefs for 'market to table' series",
      "Collab with fitness creators on high-protein seafood meal prep",
      "Work with budget finance creators on cost-saving fish buying",
      "Team up with sustainability advocates on ocean-friendly choices",
      "Collaborate with food history creators on cultural fish traditions"
    ],
    "live_stream_topics": [
      "Live fish auction or delivery unboxing with real-time pricing",
      "Q&A where viewers ask any fish-related questions",
      "Live cooking demo using fish purchased that day",
      "Behind-the-scenes market prep and opening routine",
      "Live filleting tutorial taking requests from viewers"
    ]
  },
  "twitter_content_templates": [
    {
      "template_name": "Fresh Catch Announcement",
      "format": "single tweet",
      "hook_tweet": "🐟 JUST IN: Fresh [Fish Name] caught this morning off [Location]. First 20 customers get 20% off. These won't last. [Time] until we close. 📍 [Address]",
      "thread_structure": null,
      "engagement_driver": "urgency + location tag + visual appeal",
      "best_time_to_post": "6-7 AM weekdays",
      "reply_strategy": "respond to recipe questions with quick tips, retweet customer photos"
    },
    {
      "template_name": "Fish Education Thread",
      "format": "thread",
      "hook_tweet": "Most people are buying the wrong fish for grilling. Here's what restaurants don't want you to know 🧵",
      "thread_structure": [
        "Most people are buying the wrong fish for grilling. Here's what restaurants don't want you to know 🧵",
        "1/ Thickness matters more than species. You want at least 1\" thick fillets or steaks. Thin fish dries out in seconds.",
        "2/ Oil content is everything. Salmon, tuna, swordfish = high oil = forgiving. Cod, halibut = lean = watch like a hawk.",
        "3/ Skin-on vs skinless: Keep the skin. It protects the flesh and gets crispy. Remove it after cooking if you don't like it.",
        "4/ The flip test: If it sticks to the grill, it's not ready. Fish releases when it's done on that side.",
        "5/ Our top 3 grilling picks: Salmon steaks, swordfish, mahi-mahi. Can't mess them up even if you try.",
        "Want more fish tips? We share one every Tuesday. Follow for weekly fish wisdom 🐟"
      ],
      "engagement_driver": "educational value + challenging assumptions",
      "best_time_to_post": "Tuesday 11 AM",
      "reply_strategy": "ask people their biggest grilling failures, share solutions"
    },
    {
      "template_name": "Controversial Take",
      "format": "single tweet",
      "hook_tweet": "Unpopular opinion: Farm-raised salmon is often better than wild-caught for home cooking. I said what I said. 🎣",
      "thread_structure": null,
      "engagement_driver": "controversial statement in niche industry",
      "best_time_to_post": "Wednesday 2 PM",
      "reply_strategy": "engage with both sides, explain reasoning without being defensive"
    },
    {
      "template_name": "Behind the Scenes Story",
      "format": "thread",
      "hook_tweet": "4 AM. The auction floor. This is where your dinner gets decided before you even wake up. Let me show you 🧵",
      "thread_structure": [
        "4 AM. The auction floor. This is where your dinner gets decided before you even wake up. Let me show you 🧵",
        "1/ Boats unload between 3-5 AM. We inspect every catch. Eyes, gills, smell, firmness. 30 seconds per fish to decide.",
        "2/ The auction is chaos. Hand signals, shouting in 3 languages. Miss your bid window? That's someone else's dinner special.",
        "3/ We're looking for specific things: Clear eyes (not cloudy), bright red gills, firm flesh that bounces back, ocean-fresh smell.",
        "4/ Today we scored 47 lbs of day-boat sea bass. By 6 AM it's on ice in our case. By 7 PM it's on someone's plate.",
        "5/ This is why 'fresh' actually means something. 12 hours from ocean to table. That's the standard.",
        "Come see the difference. We're open 9-7 daily 📍"
      ],
      "engagement_driver": "insider knowledge + storytelling",
      "best_time_to_post": "Thursday 9 AM",
      "reply_strategy": "answer questions about the process, invite people to visit"
    },
    {
      "template_name": "Recipe Challenge",
      "format": "poll",
      "hook_tweet": "Making fish tacos tonight. Which fish are you using? 🌮🐟\n\n(Wrong answers only... jk there's no wrong answer but I'm judging)",
      "thread_structure": null,
      "engagement_driver": "interactive poll + playful judgment",
      "best_time_to_post": "Friday 4 PM",
      "reply_strategy": "reply to each option with why it works, share your favorite prep method"
    },
    {
      "template_name": "Myth Busting",
      "format": "thread",
      "hook_tweet": "\"Fish smells fishy\" means it's fresh. This lie has destroyed more seafood meals than overcooking. Here's the truth 🧵",
      "thread_structure": [
        "\"Fish smells fishy\" means it's fresh. This lie has destroyed more seafood meals than overcooking. Here's the truth 🧵",
        "1/ Fresh fish smells like the ocean. Clean, briny, maybe a little like cucumber. That's it.",
        "2/ \"Fishy\" smell = breakdown of compounds as fish ages. It's literally the smell of decay starting.",
        "3/ If it smells fishy in the store, walk away. No amount of lemon or seasoning will fix old fish.",
        "4/ The sniff test works. Don't be shy. Ask to smell it before buying. Good fishmongers expect this.",
        "5/ Same goes for ammonia smell (especially shellfish). That's bacteria having a party. Hard pass.",
        "Fresh fish should smell like nothing or ocean. Anything else? Don't buy it."
      ],
      "engagement_driver": "debunking common belief",
      "best_time_to_post": "Monday 1 PM",
      "reply_strategy": "ask people what other fish myths they've heard"
    },
    {
      "template_name": "Customer Spotlight",
      "format": "quote tweet bait",
      "hook_tweet": "Customer just asked for \"the fish that tastes least like fish\" 😂\n\nWe gave her halibut and she's now a convert. What's your go-to starter fish for people who \"don't like fish\"?",
      "thread_structure": null,
      "engagement_driver": "relatable scenario + asking for input",
      "best_time_to_post": "Saturday 11 AM",
      "reply_strategy": "validate all answers, share why each works, build community"
    },
    {
      "template_name": "Seasonal Announcement",
      "format": "thread",
      "hook_tweet": "Soft shell crab season starts in 10 days. If you've never had them fresh, your entire life has been leading to this moment 🦀🧵",
      "thread_structure": [
        "Soft shell crab season starts in 10 days. If you've never had them fresh, your entire life has been leading to this moment 🦀🧵",
        "1/ Soft shells are blue crabs caught right after molting. You eat the ENTIRE crab. Shell, claws, everything.",
        "2/ Season is short: May-September, peak in June. Fresh ones are only available for weeks, not months.",
        "3/ How to cook: Dust in flour, pan fry in butter 3 min per side. That's it. Don't overthink it.",
        "4/ They should be alive when you buy them. Yes, alive. We'll clean them for you (takes 30 seconds).",
        "5/ Put them on a sandwich, over pasta, or just eat them with lemon. There's no wrong way.",
        "Taking pre-orders now for opening week. DM or call. These sell out in hours."
      ],
      "engagement_driver": "seasonal excitement + education",
      "best_time_to_post": "Two weeks before season",
      "reply_strategy": "share cooking tips, build anticipation, take orders"
    },
    {
      "template_name": "Quick Tip",
      "format": "single tweet",
      "hook_tweet": "Pro tip: Buy whole fish, ask us to fillet it. You get bones for stock (free), fresher product, and save $4/lb. We fillet 100+ fish daily, takes us 90 seconds.",
      "thread_structure": null,
      "engagement_driver": "money-saving tip + insider knowledge",
      "best_time_to_post": "Sunday 10 AM",
      "reply_strategy": "offer to teach people how to fillet at home"
    },
    {
      "template_name": "Weekend Prep Thread",
      "format": "thread",
      "hook_tweet": "It's Thursday. You're having people over Saturday. You're panicking about what fish to serve. I got you 🧵",
      "thread_structure": [
        "It's Thursday. You're having people over Saturday. You're panicking about what fish to serve. I got you 🧵",
        "1/ Rule 1: Cook what's freshest, not what the recipe says. We can suggest substitutes for any recipe.",
        "2/ Rule 2: Bigger pieces = easier cooking. Individual portions are for restaurants. Home cooks should buy one big piece.",
        "3/ Rule 3: Room temp before cooking. 20 min out of fridge = even cooking. Cold fish = burnt outside, raw inside.",
        "4/ Rule 4: Salt 15 min before cooking. Draws out moisture, seasons deeper, better crust.",
        "5/ Rule 5: Stop flipping. Once per side. That's it. You're not making pancakes.",
        "6/ Best crowd-pleaser? Whole roasted fish. Looks impressive, literally can't overcook it, feeds 4-6.",
        "Come in Friday, we'll set you up. Or DM me your menu, I'll tell you what to buy."
      ],
      "engagement_driver": "solving weekend anxiety + practical help",
      "best_time_to_post": "Thursday 5 PM",
      "reply_strategy": "offer personalized menu help in replies"
    }
  ],
  "twitter_thread_frameworks": [
    {
      "framework_name": "Fish Species Deep Dive",
      "hook_format": "Everything you know about [Fish Name] is wrong. Here's what [Experts/Chefs] actually know 🧵",
      "structure": [
        "Tweet 1: Hook with bold claim about misconceptions",
        "Tweet 2: Origin and seasonality facts",
        "Tweet 3: Taste profile and texture description",
        "Tweet 4: Best cooking methods with reasoning",
        "Tweet 5: Common mistakes people make",
        "Tweet 6: Substitution options and why they work",
        "Tweet 7: Price point and value comparison",
        "Tweet 8: Summary + invitation to try it"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "Why everyone should be cooking black sea bass instead of Chilean sea bass"
    },
    {
      "framework_name": "Seasonal Availability Guide",
      "hook_format": "[Month] is the secret best month for seafood. Here's what to buy and why 🧵",
      "structure": [
        "Tweet 1: Hook about underrated season",
        "Tweet 2: What's at peak freshness",
        "Tweet 3: What's most affordable",
        "Tweet 4: What to avoid this month",
        "Tweet 5: Preparation tips for seasonal items",
        "Tweet 6: Recipe or serving suggestion",
        "Tweet 7: Storage and shelf life tips",
        "Tweet 8: Next month preview + CTA to follow"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "October seafood guide: oyster season, fall fish runs, and what's actually worth buying"
    },
    {
      "framework_name": "Sustainability Explainer",
      "hook_format": "That 'sustainable' label on your fish? Let me tell you what it actually means 🧵",
      "structure": [
        "Tweet 1: Hook challenging common understanding",
        "Tweet 2: What sustainability actually measures",
        "Tweet 3: Certifications that matter vs marketing",
        "Tweet 4: Wild vs farmed: the real story",
        "Tweet 5: Regional considerations",
        "Tweet 6: How to ask the right questions",
        "Tweet 7: Best sustainable choices in our area",
        "Tweet 8: Summary + resources"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "Why some farmed fish is more sustainable than wild-caught"
    },
    {
      "framework_name": "Cooking Technique Mastery",
      "hook_format": "You're [cooking method]-ing fish wrong. This is why it keeps [common problem]. Here's the fix 🧵",
      "structure": [
        "Tweet 1: Hook identifying common problem",
        "Tweet 2: Why the problem happens (science)",
        "Tweet 3: Step 1 of correct technique",
        "Tweet 4: Step 2 with timing",
        "Tweet 5: The one thing everyone forgets",
        "Tweet 6: How to know when it's done",
        "Tweet 7: Recovery tips if you mess up",
        "Tweet 8: Best fish for this method + CTA"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "How to pan-sear fish without it sticking or falling apart"
    },
    {
      "framework_name": "Market Day Chronicle",
      "hook_format": "5:47 AM. [Location] fish market. Here's what happened in the last hour that affects your dinner 🧵",
      "structure": [
        "Tweet 1: Time-stamped hook with intrigue",
        "Tweet 2: What arrived/what's fresh",
        "Tweet 3: Auction or sourcing story",
        "Tweet 4: Quality inspection details",
        "Tweet 5: Price fluctuations and why",
        "Tweet 6: What we passed on and why",
        "Tweet 7: What's in our case today",
        "Tweet 8: Hours and invitation to visit"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "Behind the scenes of a Tuesday morning at the fish auction"
    },
    {
      "framework_name": "Myth vs Reality Series",
      "hook_format": "Fish industry myths that need to die. A thread of truths your fishmonger wishes you knew 🧵",
      "structure": [
        "Tweet 1: Hook promising myth-busting",
        "Tweet 2-6: Myth: [statement] Reality: [truth] (one per tweet)",
        "Tweet 7: Why these myths persist",
        "Tweet 8: How to spot quality yourself + follow CTA"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "Debunking 5 common fish freshness myths"
    },
    {
      "framework_name": "Value Guide",
      "hook_format": "You're overpaying for fish. Here's where to save money without sacrificing quality 🧵",
      "structure": [
        "Tweet 1: Hook about overpaying",
        "Tweet 2: Underrated affordable fish",
        "Tweet 3: When to buy vs when to wait",
        "Tweet 4: Whole vs fillet math breakdown",
        "Tweet 5: Frozen vs fresh: when frozen wins",
        "Tweet 6: Questions to ask for best value",
        "Tweet 7: What premium prices actually get you",
        "Tweet 8: This week's best values + shop info"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "How to eat great seafood on a budget"
    },
    {
      "framework_name": "Problem-Solution Story",
      "hook_format": "Customer came in yesterday with [problem]. Here's how we fixed it (and how you can too) 🧵",
      "structure": [
        "Tweet 1: Customer problem hook",
        "Tweet 2: Why this problem is common",
        "Tweet 3: What they tried that didn't work",
        "Tweet 4: Our solution",
        "Tweet 5: The science/reasoning behind it",
        "Tweet 6: How to apply this at home",
        "Tweet 7: Other situations where this works",
        "Tweet 8: Invitation to ask questions"
      ],
      "optimal_length": "8 tweets",
      "example_topic": "Customer couldn't get crispy skin on salmon - here's the fix"
    }
  ],
  "twitter_engagement_hooks": [
    {
      "hook": "Salmon should never cost less than $12/lb. If it does, you need to ask questions. A lot of questions.",
      "type": "controversial",
      "expected_engagement": "replies",
      "follow_up_strategy": "explain quality indicators and farming practices in thread of replies"
    },
    {
      "hook": "What's the one fish you refuse to eat and why? (I'll tell you if you're right or wrong)",
      "type": "question",
      "expected_engagement": "replies",
      "follow_up_strategy": "respond to each with education about that species, build conversation"
    },
    {
      "hook": "Unpopular opinion: Tilapia gets way too much hate. It's actually perfect for beginners and I'll die on this hill.",
      "type": "hot take",
      "expected_engagement": "quotes",
      "follow_up_strategy": "engage with quote tweets, explain use cases, share beginner recipes"
    },
    {
      "hook": "Just watched someone at the grocery store smell fish through the plastic wrap. I'm not okay.",
      "type": "confession",
      "expected_engagement": "retweets",
      "follow_up_strategy": "share proper fish selection tips, turn into educational moment"
    },
    {
      "hook": "In 5 years, most 'fresh' fish will actually be frozen-then-thawed and people won't even know the difference.",
      "type": "prediction",
      "expected_engagement": "replies",
      "follow_up_strategy": "discuss industry trends, explain why this isn't necessarily bad"
    },
    {
      "hook": "Fish that taste nothing like 'fish': 1. Halibut 2. Mahi-mahi 3. [blank] - what's your #3?",
      "type": "question",
      "expected_engagement": "replies",
      "follow_up_strategy": "validate answers, explain flavor profiles, build community"
    },
    {
      "hook": "The difference between a $15 salmon fillet and a $30 salmon fillet, explained in one sentence: One was swimming yesterday.",
      "type": "breakdown",
      "expected_engagement": "retweets",
      "follow_up_strategy": "expand on freshness indicators, offer to teach in-store"
    },
    {
      "hook": "I've been selling fish for 15 years and still can't convince people that frozen-at-sea is often better than 'fresh'. The marketing has won.",
      "type": "confession",
      "expected_engagement": "quotes",
      "follow_up_strategy": "explain freezing technology, share studies, change minds"
    },
    {
      "hook": "Show me a picture of fish you bought at the grocery store and I'll tell you exactly how many days ago it was caught.",
      "type": "humble brag",
      "expected_engagement": "replies",
      "follow_up_strategy": "analyze photos, teach identification skills, build authority"
    },
    {
      "hook": "Fish cooking times: 10 min per inch of thickness. I just saved you from 90% of seafood mistakes. You're welcome.",
      "type": "breakdown",
      "expected_engagement": "retweets",
      "follow_up_strategy": "answer exceptions in replies, share other timing rules"
    },
    {
      "hook": "Wild-caught isn't always better than farmed. Farm-raised isn't always worse than wild. The real answer? It depends. Thread 🧵",
      "type": "hot take",
      "expected_engagement": "retweets",
      "follow_up_strategy": "deliver educational thread, cite sources, build credibility"
    },
    {
      "hook": "Things I've heard customers say this week: 'Can you make the fish not taste like fish?' Ma'am, I'm a fishmonger, not a wizard.",
      "type": "confession",
      "expected_engagement": "replies",
      "follow_up_strategy": "share funny customer stories, keep it light, build relatability"
    },
    {
      "hook": "Red snapper at your grocery store probably isn't red snapper. Here's what it actually is:",
      "type": "controversial",
      "expected_engagement": "replies",
      "follow_up_strategy": "explain mislabeling issues, share how to verify species"
    },
    {
      "hook": "Rate your fish cooking confidence 1-10. If you're below 7, I can fix that in one DM.",
      "type": "question",
      "expected_engagement": "replies",
      "follow_up_strategy": "offer personal tips in DMs, convert to customers"
    },
    {
      "hook": "By 2030, most sushi won't contain any fish. Plant-based seafood is about to change everything and nobody's ready for it.",
      "type": "prediction",
      "expected_engagement": "quotes",
      "follow_up_strategy": "discuss innovation, share tastings, stay ahead of trends"
    },
    {
      "hook": "Grocery store fish case at 8 PM vs 8 AM is like comparing a crime scene to a garden. Please stop shopping for fish at night.",
      "type": "hot take",
      "expected_engagement": "retweets",
      "follow_up_strategy": "explain turnover and freshness timing, share shopping tips"
    },
    {
      "hook": "Name a fish. I'll tell you the biggest mistake people make cooking it. Go.",
      "type": "question",
      "expected_engagement": "replies",
      "follow_up_strategy": "rapid-fire reply to each, build engagement, showcase expertise"
    },
    {
      "hook": "Just sold someone 'sushi-grade' tuna. That term is completely made up and means nothing. But they're happy so 🤷",
      "type": "confession",
      "expected_engagement": "replies",
      "follow_up_strategy": "explain FDA guidelines, teach what to actually look for"
    },
    {
      "hook": "Fish you should be eating more of: 1. Mackerel 2. Sardines 3. Anchovies. Yes, I'm serious. Yes, they're incredible. No, you won't smell.",
      "type": "breakdown",
      "expected_engagement": "quotes",
      "follow_up_strategy": "share recipes, combat stigma, promote sustainable options"
    },
    {
      "hook": "The fish industry's biggest secret: Most 'fresh' fish has been frozen at some point. And that's actually a good thing. Let me explain:",
      "type": "controversial",
      "expected_engagement": "retweets",
      "follow_up_strategy": "explain supply chain, safety protocols, change perceptions"
    }
  ],
  "twitter_growth_tactics": {
    "reply_guy_strategy": {
      "accounts_to_engage": [
        "Food bloggers and recipe creators with 10k-100k followers",
        "Local chefs and restaurant accounts",
        "Cooking show hosts and food TV personalities",
        "Sustainability advocates and ocean conservation accounts",
        "Home cooking enthusiasts sharing meal prep content"
      ],
      "reply_templates": [
        "Great technique! Pro tip: [specific fish advice relevant to their post]",
        "This would be incredible with [specific fish]. We just got some in this morning if you're local 👀",
        "Small correction: [gentle expertise]. Otherwise perfect execution!",
        "The [fish type] in this looks perfectly cooked. What's your secret? (asking for our customers)"
      ],
      "timing": "reply within first hour of their post, especially morning posts (7-9 AM)"
    },
    "quote_tweet_opportunities": [
      "Viral food fails involving seafood (offer solutions)",
      "Celebrity chefs making fish (praise or add expertise)",
      "News about ocean sustainability or fishing industry",
      "Trending recipes that could use fish substitutions",
      "Grocery store complaints about fish quality (position yourself as alternative)",
      "Food trends that involve seafood",
      "Local food events and farmers markets announcements"
    ],
    "spaces_topics": [
      "How to buy fish like a professional chef",
      "Sustainability in seafood: what actually matters",
      "Fish cooking Q&A: bring your disasters, we'll fix them",
      "Behind the scenes: a day at the fish market",
      "Seasonal seafood guide with local chefs",
      "Debunking fish myths with marine biologists"
    ],
    "dm_outreach_templates": [
      "Hey! Saw your [specific post about fish/cooking]. We're a local fish market and would love to send you some [specific fish] to try. No strings, just want to support great content.",
      "Love your cooking content! We're doing a sustainable seafood education series and would love to feature local food creators. Interested in collaborating?",
      "Noticed you're in [city]. We source directly from [specific source] and thought you might appreciate knowing about a local option. Stop by sometime - first purchase on us."
    ],
    "list_building_strategy": "Create curated lists: 'Local Food Scene', 'Seafood Chefs', 'Ocean Advocates', 'Home Cooking Heroes'. Engage with list members daily. They get notified when added. Use lists to find quote tweet opportunities and reply targets. Promote list in bio as resource."
  }
}